{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "The Sevens... \"Go Kiwis!\""
    ],
    "content": [
      {
        "html": "<p>Every year, the top 16 countries in rugby send teams to participate in the International Rugby Sevens tourney in Wellington for two days jam packed with 44 games.  Sevens is a form of rugby where each side has 7 players, instead of the typical 15, and the game is played in two 7 minute halves.  This makes for an extremely fast-paced form of rugby that even Americans can enjoy =)</p><p>I purchased tickets for the Sevens before leaving the states through a friend here in Wellington, and convinced some guys on the trip to come along with me.  After renting a car in Lake Taupo and arriving in Wellington late on Thursday night, we woke up on Friday morning and headed down to WestPac Stadium for the start of the Sevens.  Upon arriving, we assaulted my kiwi friend with questions about the game, so that we would understand what was going on.  Its a fairly simple game, so we got into it early on.</p><p>The first match of the day was the U.S.A. against South Africa.  We found out quickly that the U.S. isn't known for its rugby teams, as South Africa trounced us 26-5, and then Samoa took us to school 49-0.  Ouch!  The U.S. did get a victory later in the day by defeating the Cook Islands 26-12.  We made sure to play the role of the obnoxious Americans during the whole first day, chanting and shouting for the U.S. even though we were terrible =)</p><p>The New Zealand team on the other hand is incredible.  They are strong, confident, and play with bursts of speed that are unrivaled by the rest of the world.  They outscored opponents 112-12 on the first day, taking out Tonga, Papua New Ginuea, and then destroying England in the final match of the first evening.</p><p>The next day, my friend's family invited us up to their house for a Kiwi BBQ before the following days matches, and we gladly accepted the offer.  The food was great, and got us charged up before Saturday's festivities.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/usatthesevens.jpg\"><img alt=\"usatthesevens.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/usatthesevens-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/sevensparade.jpg\"><img alt=\"sevensparade.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/sevensparade-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/menzvictory.jpg\"><img alt=\"menzvictory.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/menzvictory-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/nzvictory.jpg\"><img alt=\"nzvictory.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/nzvictory-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>By the time the second day rolled around, we were all huge fans of this rugby thing, and had decided to go ahead and pull for the home team.  This allowed us to make a lot of friends in the stands, who would in turn pull for the U.S. team too.  The U.S. team won two in a row to advance to the Bowl Semifinals, where we tragically lost a close match to a tiny little Pacific island team called Niue... we were crushed.</p><p>The New Zealand team, however, had worked its way into the brackets for the championship game, which it had never won at home in Wellington.  The kiwis beat the Samoans in a very close match early on to advance to the semifinals, where they played Fiji, a powerhouse.  This was easily the best game of the day, as the Kiwis rallied from losing a man to a yellow card and won the game by scoring on the last play of the game to advance to the Cup Championship against England, who surprisingly defeated Australia and was out for blood against NZ after its embarrassing defeat the night before.</p><p>As the final approached, the crowds were firing themselves up by singing Kiwi drinking songs, and the energy level was high.  The crowds tend to dress themselves up as random characters like Santa Claus, Colonel Sanders, Fred Flintstone, or even Satan.  The funniest group decided to dress up as a bunch of U.S. commandos, and they had Osama Bin Laden in chains and would beat him up on the big screen every time New Zealand scored in a game!  Very funny stuff!  Today I was watching the local news coverage and saw some folks dressed up as Pooh Bear and Eeyore, which reminded me of Lacey in her costume a few Halloweens ago!  Lacey in an Eeyore costume at the Sevens would be one of the funniest sights in the world =)</p><p>In the final game, New Zealand won a close match with England to capture its first tourney win at home.  The team walked around the stadium doing a dance for the audience as people chanted \"Go Kiwis!\"  Last night we celebrated with the city of Wellington until 3:30 AM and enjoyed being honorary Kiwis for a day.  What a fantastic weekend!</p>",
        "value": "Every year, the top 16 countries in rugby send teams to participate in the International Rugby Sevens tourney in Wellington for two days jam packed with 44 games. Sevens is a form of rugby where each side has 7 players, instead of the typical 15, and the game is played in two 7 minute halves. This makes for an extremely fast-paced form of rugby that even Americans can enjoy =)\nI purchased tickets for the Sevens before leaving the states through a friend here in Wellington, and convinced some guys on the trip to come along with me. After renting a car in Lake Taupo and arriving in Wellington late on Thursday night, we woke up on Friday morning and headed down to WestPac Stadium for the start of the Sevens. Upon arriving, we assaulted my kiwi friend with questions about the game, so that we would understand what was going on. Its a fairly simple game, so we got into it early on.\nThe first match of the day was the U.S.A. against South Africa. We found out quickly that the U.S. isn't known for its rugby teams, as South Africa trounced us 26-5, and then Samoa took us to school 49-0. Ouch! The U.S. did get a victory later in the day by defeating the Cook Islands 26-12. We made sure to play the role of the obnoxious Americans during the whole first day, chanting and shouting for the U.S. even though we were terrible =)\nThe New Zealand team on the other hand is incredible. They are strong, confident, and play with bursts of speed that are unrivaled by the rest of the world. They outscored opponents 112-12 on the first day, taking out Tonga, Papua New Ginuea, and then destroying England in the final match of the first evening.\nThe next day, my friend's family invited us up to their house for a Kiwi BBQ before the following days matches, and we gladly accepted the offer. The food was great, and got us charged up before Saturday's festivities. usatthesevens.jpg sevensparade.jpg menzvictory.jpg nzvictory.jpg\nBy the time the second day rolled around, we were all huge fans of this rugby thing, and had decided to go ahead and pull for the home team. This allowed us to make a lot of friends in the stands, who would in turn pull for the U.S. team too. The U.S. team won two in a row to advance to the Bowl Semifinals, where we tragically lost a close match to a tiny little Pacific island team called Niue... we were crushed.\nThe New Zealand team, however, had worked its way into the brackets for the championship game, which it had never won at home in Wellington. The kiwis beat the Samoans in a very close match early on to advance to the semifinals, where they played Fiji, a powerhouse. This was easily the best game of the day, as the Kiwis rallied from losing a man to a yellow card and won the game by scoring on the last play of the game to advance to the Cup Championship against England, who surprisingly defeated Australia and was out for blood against NZ after its embarrassing defeat the night before.\nAs the final approached, the crowds were firing themselves up by singing Kiwi drinking songs, and the energy level was high. The crowds tend to dress themselves up as random characters like Santa Claus, Colonel Sanders, Fred Flintstone, or even Satan. The funniest group decided to dress up as a bunch of U.S. commandos, and they had Osama Bin Laden in chains and would beat him up on the big screen every time New Zealand scored in a game! Very funny stuff! Today I was watching the local news coverage and saw some folks dressed up as Pooh Bear and Eeyore, which reminded me of Lacey in her costume a few Halloweens ago! Lacey in an Eeyore costume at the Sevens would be one of the funniest sights in the world =)\nIn the final game, New Zealand won a close match with England to capture its first tourney win at home. The team walked around the stadium doing a dance for the audience as people chanted \"Go Kiwis!\" Last night we celebrated with the city of Wellington until 3:30 AM and enjoyed being honorary Kiwis for a day. What a fantastic weekend!"
      }
    ],
    "url": [
      "/2003/the-sevens-go-kiwis"
    ],
    "published": [
      "2003-02-08T23:45:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "12a258e818f595d3c98e16703e9d5680"
    ]
  }
}