{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Sumo in Osaka and the Great Buddha Temple"
    ],
    "content": [
      {
        "html": "<p>Yesterday, a large group of us piled into Kyoto Station with our rail passes, and hopped on an early morning train to Osaka.  After a short walk, we arrived at the Osaka stadium around 10:00 AM, and purchased standing-room only tickets for a full day of Sumo Wrestling at a small cost of ¥ 1400 (about $12 USD).</p><p>We went into the stadium in the morning to catch the early matches, and were surprised to find the arena to be fairly empty.  It turns out that the wrestling goes on all day long, and that the lower ranking wrestlers wrestle in the morning, while the best and brightest wrestle after 3:00 PM.  So, we watched some of the early matches, got a few pictures with the wrestlers, and then went to lunch.  I had a fried chicken dish at a tiny restaurant, and wasn't really all that impressed.  We then walked around Osaka for a little while before heading back in.</p><p>There was a pretty cool ceremony at 2:45 PM, where the high-ranking wrestlers come out and parade around the ring, and a lot of odd rituals and singing go on.  Then, the big men started to battle — I have never seen fat guys this violent in my life!  If you think that sumo looks violent on television, you should see it when these guys are pounding into each other live!  It was a very cool experience and I had a lot of fun.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/kyoto/sumo-rink.jpg\"><img alt=\"sumo-rink.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/sumo-rink-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/me-and-wrestler.jpg\"><img alt=\"me-and-wrestler.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/kyoto/me-and-wrestler-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/me-normer-robes.jpg\"><img alt=\"me-normer-robes.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/me-normer-robes-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Today is our travel day, and our train was scheduled to leave at 4:47 PM from Kyoto Station, so a group of us decided to check out of the hotel a bit early, and go on a quick day-trip to Nara, which is a short 45 minute train ride away.  We arrived in Nara around noon, and walked through the torrential rain to the Great Buddha Temple, which is one of the largest temples that I have ever seen.  Inside the temple is a massive statue of Buddha, which must be at least 3 or 4 stories tall.  It is also home to a number of other cool statues and shrines.</p><p>While inside the temple, a group of little Japanese school girls came up to me and asked me in broken english to take their picture.  I obliged, and they were all giggling at me, becuase I am a tall white man (which is apparantly very attractive in their culture).  After taking about 10 pictures for them, I got one of my friends to take my picture with them, and they busted out into a roar of giggling and jumping, that was actually quite funny.  So, apparantly, I now have a small fanclub of Japanese school girls — although I am not sure if that will ever come in useful =)</p><p>Probably the coolest part about the temple is a tiny little hole in one of the massive wooden pillars at the back of the temple.  Why, you ask?  Because this small hole is supposed to represent Buddha's nostril, and if you are able to squeeze yourself through it, you can attain enlightenment.  Well, this I could simply not pass up on, so I was the first of our group to make an attempt.  After some painful wriggling, I emerged on the other side successfully, and I am apparantly more enlightened as a result of the journey.  Hooray for me I suppose =)</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/kyoto/great-buddha-temple.jpg\"><img alt=\"great-buddha-temple.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/great-buddha-temple-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/great-buddha.jpg\"><img alt=\"great-buddha.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/great-buddha-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/me-and-fanclub.jpg\"><img alt=\"me-and-fanclub.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/me-and-fanclub-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/kyoto/giant-statue.jpg\"><img alt=\"giant-statue.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/kyoto/giant-statue-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/path-to-enlightenment.jpg\"><img alt=\"path-to-enlightenment.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/kyoto/path-to-enlightenment-thumb.jpg\" width=\"90\"/></a>\n</td>\n</tr></tbody></table><p>I am now riding on the <em>Hikari Superexpress</em> bullet train on the way to Hiroshima.  This train is moving ridiculously fast, is very cushy, and also quite smooth — such a great way to travel!  Japan is a very dense country through, and in my hour or so on the train thus far, I have seen very little green space, lots of ugly industrial areas, and a plentitude of advertisements.  I really doubt that I could live in such a dreary place, and I am hoping that Hiroshima will change my opinion.  Don't get me wrong, Japan is a great place to be, and I am having a blast, but I am very surprised at how uniformly dense and urban this country is so far.</p><p>I am having an excellent time in Japan, and I am looking forward to my last few weeks away from home.  Love you and miss you all!</p>",
        "value": "Yesterday, a large group of us piled into Kyoto Station with our rail passes, and hopped on an early morning train to Osaka. After a short walk, we arrived at the Osaka stadium around 10:00 AM, and purchased standing-room only tickets for a full day of Sumo Wrestling at a small cost of ¥ 1400 (about $12 USD).\nWe went into the stadium in the morning to catch the early matches, and were surprised to find the arena to be fairly empty. It turns out that the wrestling goes on all day long, and that the lower ranking wrestlers wrestle in the morning, while the best and brightest wrestle after 3:00 PM. So, we watched some of the early matches, got a few pictures with the wrestlers, and then went to lunch. I had a fried chicken dish at a tiny restaurant, and wasn't really all that impressed. We then walked around Osaka for a little while before heading back in.\nThere was a pretty cool ceremony at 2:45 PM, where the high-ranking wrestlers come out and parade around the ring, and a lot of odd rituals and singing go on. Then, the big men started to battle — I have never seen fat guys this violent in my life! If you think that sumo looks violent on television, you should see it when these guys are pounding into each other live! It was a very cool experience and I had a lot of fun. sumo-rink.jpg me-and-wrestler.jpg me-normer-robes.jpg\nToday is our travel day, and our train was scheduled to leave at 4:47 PM from Kyoto Station, so a group of us decided to check out of the hotel a bit early, and go on a quick day-trip to Nara, which is a short 45 minute train ride away. We arrived in Nara around noon, and walked through the torrential rain to the Great Buddha Temple, which is one of the largest temples that I have ever seen. Inside the temple is a massive statue of Buddha, which must be at least 3 or 4 stories tall. It is also home to a number of other cool statues and shrines.\nWhile inside the temple, a group of little Japanese school girls came up to me and asked me in broken english to take their picture. I obliged, and they were all giggling at me, becuase I am a tall white man (which is apparantly very attractive in their culture). After taking about 10 pictures for them, I got one of my friends to take my picture with them, and they busted out into a roar of giggling and jumping, that was actually quite funny. So, apparantly, I now have a small fanclub of Japanese school girls — although I am not sure if that will ever come in useful =)\nProbably the coolest part about the temple is a tiny little hole in one of the massive wooden pillars at the back of the temple. Why, you ask? Because this small hole is supposed to represent Buddha's nostril, and if you are able to squeeze yourself through it, you can attain enlightenment. Well, this I could simply not pass up on, so I was the first of our group to make an attempt. After some painful wriggling, I emerged on the other side successfully, and I am apparantly more enlightened as a result of the journey. Hooray for me I suppose =) great-buddha-temple.jpg great-buddha.jpg me-and-fanclub.jpg giant-statue.jpg path-to-enlightenment.jpg\nI am now riding on the Hikari Superexpress bullet train on the way to Hiroshima. This train is moving ridiculously fast, is very cushy, and also quite smooth — such a great way to travel! Japan is a very dense country through, and in my hour or so on the train thus far, I have seen very little green space, lots of ugly industrial areas, and a plentitude of advertisements. I really doubt that I could live in such a dreary place, and I am hoping that Hiroshima will change my opinion. Don't get me wrong, Japan is a great place to be, and I am having a blast, but I am very surprised at how uniformly dense and urban this country is so far.\nI am having an excellent time in Japan, and I am looking forward to my last few weeks away from home. Love you and miss you all!"
      }
    ],
    "url": [
      "/2003/sumo-in-osaka-and-the-great-buddha-temple"
    ],
    "published": [
      "2003-03-16T18:15:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "e748841c07fb752614405a029e89a869"
    ]
  }
}