{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "A day in New York"
    ],
    "content": [
      {
        "html": "<p>I spent the day today in New York City taking in the sights, eating excellent food, and spending time with my family.  We hopped on a train from South Orange and were in New York Penn. Station within 30 minutes — what a fantastic way to commute!  I wish that Atlanta had a nice rail system that I could utilize, it sure beats traffic.  But I digress....</p><p>We started out the day by hitting the B&amp;H Camera Shop, where I was able to pick up a new battery for my digital camera, and a nice leather case.  Then we walked over to Grand Central Station to eat at the Oyster Bar, which is an excellent little restraunt with wonderful soup and seafood.  Grand Central is such a beautiful public space of the kind that I don't expect to see again in this country.  What a shame!</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christmas/chrystlernyc.JPG\"><img alt=\"chrystlernyc.JPG\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christmas/chrystlernyc-thumb.JPG\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christmas/ingrandcentral.JPG\"><img alt=\"ingrandcentral.JPG\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christmas/ingrandcentral-thumb.JPG\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christmas/outgrandcentral.JPG\"><img alt=\"outgrandcentral.JPG\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christmas/outgrandcentral-thumb.JPG\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christmas/publiclibrary.JPG\"><img alt=\"publiclibrary.JPG\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christmas/publiclibrary-thumb.JPG\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christmas/traintrack.JPG\"><img alt=\"traintrack.JPG\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christmas/traintrack-thumb.JPG\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Then we walked over to the Chrystler building to take a look at the lobby, which I didn't find all that interesting.  The last stop of the day was the New York Public Library, which was absolutely gorgeous.  Again, a public space from a time long forgotten, which is unlikely to be matched any time soon.</p><p>Tomorrow morning at 9:40 I head back to Atlanta for my last week in the country before I leave for study abroad.  Until then...</p>",
        "value": "I spent the day today in New York City taking in the sights, eating excellent food, and spending time with my family. We hopped on a train from South Orange and were in New York Penn. Station within 30 minutes — what a fantastic way to commute! I wish that Atlanta had a nice rail system that I could utilize, it sure beats traffic. But I digress....\nWe started out the day by hitting the B&H Camera Shop, where I was able to pick up a new battery for my digital camera, and a nice leather case. Then we walked over to Grand Central Station to eat at the Oyster Bar, which is an excellent little restraunt with wonderful soup and seafood. Grand Central is such a beautiful public space of the kind that I don't expect to see again in this country. What a shame! chrystlernyc.JPG ingrandcentral.JPG outgrandcentral.JPG publiclibrary.JPG traintrack.JPG\nThen we walked over to the Chrystler building to take a look at the lobby, which I didn't find all that interesting. The last stop of the day was the New York Public Library, which was absolutely gorgeous. Again, a public space from a time long forgotten, which is unlikely to be matched any time soon.\nTomorrow morning at 9:40 I head back to Atlanta for my last week in the country before I leave for study abroad. Until then..."
      }
    ],
    "url": [
      "/2002/a-day-in-new-york"
    ],
    "published": [
      "2002-12-27T00:14:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "e1fcd3d4c9970e5a1b78cb1765f164d4"
    ]
  }
}