{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Arrival in Sydney!"
    ],
    "content": [
      {
        "html": "<p>Yesterday, I arrived in Sydney after a short plane ride on Qantas.  The flight was fine, but somehow they switched everyone in our group to Vegetarian meals, so I was forced to eat 3 tiny pieces of fruit for lunch... needless to say I was hungry when I arrived.</p><p>We are staying at the Santa Sophia college while we are here in Sydney, which is a strict catholic school with nuns everywhere.  If putting 90 college students with a habit of binge drinking in the same place as 20 nuns (who incidentally <em>wear</em> habits) isn't a recipe for disaster, I don't know what is.  Anyway, the rooms are fairly nice, and the food is excellent, so I am not complaining.</p><p>We didn't really do all that much last night once we got here, since we were all fairly tired, but this afternoon following class I went with a group and walked around downtown.  We purchased a student bus pass for the entire week, and took the bus to the edge of the city and just started walking.  About an hour and a half later, we ended up at the Sydney Opera House.  The Opera House is a stunning building that I have seen pictures of many times, but experiencing it first hand was excellent.  Of course, the building looks a lot better from afar than it does from up close, but its still a crazy and beautiful building.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/sydney/mebridge.jpg\"><img alt=\"mebridge.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/mebridge-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/sydney/meoperahouse.jpg\"><img alt=\"meoperahouse.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/meoperahouse-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/sydney/cityfromoperahouse.jpg\"><img alt=\"cityfromoperahouse.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/cityfromoperahouse-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>My first impression of Sydney is that it is a bit more like an American city than Brisbane.  Sydney is about three times larger in population than Brisbane, slightly larger than Atlanta, and grew very quickly with very little planning.  As a result, Sydney reminds me of home.  It has its beautiful parts where the tourists go, but for the most part, its a bit dirty, and not nearly as attractive of a city as I thought it would be.</p><p>On the way home, I signed up with a group of people to go snorkeling on the Great Barrier Reef when we are in Cairns in a few weeks.  This promises to be very interesting.  Anyway, I will blog again tomorrow after my field trip.</p>",
        "value": "Yesterday, I arrived in Sydney after a short plane ride on Qantas. The flight was fine, but somehow they switched everyone in our group to Vegetarian meals, so I was forced to eat 3 tiny pieces of fruit for lunch... needless to say I was hungry when I arrived.\nWe are staying at the Santa Sophia college while we are here in Sydney, which is a strict catholic school with nuns everywhere. If putting 90 college students with a habit of binge drinking in the same place as 20 nuns (who incidentally wear habits) isn't a recipe for disaster, I don't know what is. Anyway, the rooms are fairly nice, and the food is excellent, so I am not complaining.\nWe didn't really do all that much last night once we got here, since we were all fairly tired, but this afternoon following class I went with a group and walked around downtown. We purchased a student bus pass for the entire week, and took the bus to the edge of the city and just started walking. About an hour and a half later, we ended up at the Sydney Opera House. The Opera House is a stunning building that I have seen pictures of many times, but experiencing it first hand was excellent. Of course, the building looks a lot better from afar than it does from up close, but its still a crazy and beautiful building. mebridge.jpg meoperahouse.jpg cityfromoperahouse.jpg\nMy first impression of Sydney is that it is a bit more like an American city than Brisbane. Sydney is about three times larger in population than Brisbane, slightly larger than Atlanta, and grew very quickly with very little planning. As a result, Sydney reminds me of home. It has its beautiful parts where the tourists go, but for the most part, its a bit dirty, and not nearly as attractive of a city as I thought it would be.\nOn the way home, I signed up with a group of people to go snorkeling on the Great Barrier Reef when we are in Cairns in a few weeks. This promises to be very interesting. Anyway, I will blog again tomorrow after my field trip."
      }
    ],
    "url": [
      "/2003/arrival-in-sydney"
    ],
    "published": [
      "2003-01-13T05:01:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "122d36c84725556134bb9f894aeb4df0"
    ]
  }
}