{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Zebo's, \"The Fats\", and Somes Island"
    ],
    "content": [
      {
        "html": "<p>Last night, we decided it would be a good night for going out on the town, since there were a few people having birthdays yesterday.  A friend of mine from Wellington gave us some tips on where to go, and we headed out and met her at a little bar called <i>Zebo's</i>.  We stayed there for a little while, and then travelled to Wellington's most famous bar <i>The Fat Lady's Arms</i>, or as they lovingly call it <i>\"The Fats\"</i>.  The Fats is to bars what Waffle House is to restaurants.  As a result, The Fats has a sign inside proclaiming that it is \"the best bar in the world.\"  After my experience there, I don't doubt it.  We had a great time hanging out there, playing pool, and people-watching, and we eventually called it a night.</p><p>This morning, we went on a field trip with my Biology class to see Somes Island, which is a small island out in the center of Wellington's waterfront harbor.  The island used to be used as a quarantine for animal research, and has since been turned into a wildlife reserve.  We hopped on a ferry for a short 20 minute ride and arrived at the island around 11:00 AM.  We were free to walk on the island pretty much all day, and started by hiking around the island's perimeter.  While walking we encountered sheep, birds, and beautiful mountainous landscapes.  The view was also excellent, but we decided that walking around the island wasn't enough.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/theferry.jpg\"><img alt=\"theferry.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/theferry-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/baseofisland.jpg\"><img alt=\"baseofisland.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/baseofisland-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/perimeterwalk.jpg\"><img alt=\"perimeterwalk.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/perimeterwalk-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/sheeponisland.jpg\"><img alt=\"sheeponisland.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/sheeponisland-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/meandscottinthetree.jpg\"><img alt=\"meandscottinthetree.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/wellington/meandscottinthetree-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/meontopofisland.jpg\"><img alt=\"meontopofisland.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/meontopofisland-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>A few of us broke off from the rest of the group and left the path to find a way to climb to the island's peak.  We found a small path hidden somewhat from the main track, and ducked our way through vegetation until we emerged at the top of the island.  The view was amazing, and we had put ourselves in a little bit of danger — which felt good.  Not good enough though... so we found a tree at the crest of a hill, and took turns climbing it in the furious wind.  Satisfied with ourselves, we descended back down to the base of the island, and ate lunch on a little stone bench with a beautiful view of the ocean and Wellington.</p><p>This evening, we went to see <i>\"My Big, Fat, Greek Wedding\"</i> at a theater down on the waterfront, and took it easy because we were all exhausted.  Still having a great time here in Wellington, and I miss you all!</p>",
        "value": "Last night, we decided it would be a good night for going out on the town, since there were a few people having birthdays yesterday. A friend of mine from Wellington gave us some tips on where to go, and we headed out and met her at a little bar called Zebo's. We stayed there for a little while, and then travelled to Wellington's most famous bar The Fat Lady's Arms, or as they lovingly call it \"The Fats\". The Fats is to bars what Waffle House is to restaurants. As a result, The Fats has a sign inside proclaiming that it is \"the best bar in the world.\" After my experience there, I don't doubt it. We had a great time hanging out there, playing pool, and people-watching, and we eventually called it a night.\nThis morning, we went on a field trip with my Biology class to see Somes Island, which is a small island out in the center of Wellington's waterfront harbor. The island used to be used as a quarantine for animal research, and has since been turned into a wildlife reserve. We hopped on a ferry for a short 20 minute ride and arrived at the island around 11:00 AM. We were free to walk on the island pretty much all day, and started by hiking around the island's perimeter. While walking we encountered sheep, birds, and beautiful mountainous landscapes. The view was also excellent, but we decided that walking around the island wasn't enough. theferry.jpg baseofisland.jpg perimeterwalk.jpg sheeponisland.jpg meandscottinthetree.jpg meontopofisland.jpg\nA few of us broke off from the rest of the group and left the path to find a way to climb to the island's peak. We found a small path hidden somewhat from the main track, and ducked our way through vegetation until we emerged at the top of the island. The view was amazing, and we had put ourselves in a little bit of danger — which felt good. Not good enough though... so we found a tree at the crest of a hill, and took turns climbing it in the furious wind. Satisfied with ourselves, we descended back down to the base of the island, and ate lunch on a little stone bench with a beautiful view of the ocean and Wellington.\nThis evening, we went to see \"My Big, Fat, Greek Wedding\" at a theater down on the waterfront, and took it easy because we were all exhausted. Still having a great time here in Wellington, and I miss you all!"
      }
    ],
    "url": [
      "/2003/zebos-the-fats-and-somes-island"
    ],
    "published": [
      "2003-01-30T23:14:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "ed27eec8d0e58b56f8711b49b13c18fd"
    ]
  }
}