{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "I am off!"
    ],
    "content": [
      {
        "html": "<p>At 6:45 PM, I took off for London on a Boeing 777, to return in 12 weeks.  There isn't anything much worse than having to say <i>goodbye</i> to loved ones for 90 days.  I am really going to miss all the comforts of home, but I am hoping that being outside of those comforts will allow for me to learn some new things about myself and the world.</p><p>I am currently over the Atlantic Ocean about an hour away from my destination, and they have just inexplicably turned on all lights in the cabin to serve breakfast.  It seemst that they concluded that 2-4 hours of sleep between dinner and breakfast is just about right =)</p><p>Watching an entire cabin of people groan themselves awake is high comedy.  Looking around the cabin, people are covered by blankets that are exactly too small to cover you, resting their heads on pillows that resemble chiclets in both size and texture... and we *pay* for this!</p><p>I will update later on today once I have spent some time in London.  The plan is to enjoy a nice Guinness, and go on an epic quest to find somewhere to watch the college football national championship (impossible...).</p>",
        "value": "At 6:45 PM, I took off for London on a Boeing 777, to return in 12 weeks. There isn't anything much worse than having to say goodbye to loved ones for 90 days. I am really going to miss all the comforts of home, but I am hoping that being outside of those comforts will allow for me to learn some new things about myself and the world.\nI am currently over the Atlantic Ocean about an hour away from my destination, and they have just inexplicably turned on all lights in the cabin to serve breakfast. It seemst that they concluded that 2-4 hours of sleep between dinner and breakfast is just about right =)\nWatching an entire cabin of people groan themselves awake is high comedy. Looking around the cabin, people are covered by blankets that are exactly too small to cover you, resting their heads on pillows that resemble chiclets in both size and texture... and we *pay* for this!\nI will update later on today once I have spent some time in London. The plan is to enjoy a nice Guinness, and go on an epic quest to find somewhere to watch the college football national championship (impossible...)."
      }
    ],
    "url": [
      "/2003/i-am-off"
    ],
    "published": [
      "2003-01-03T00:46:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "0d8f39bfa2770564c731ea4556e5fed3"
    ]
  }
}