{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      },
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "logo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ],
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Watched The Repair Shop 5x03 \"Episode 3\""
    ],
    "item": [
      {
        "type": [
          "h-product"
        ],
        "properties": {
          "photo": [
            "https://cleverdevil.io/file/4526528ff51dc5e6911b5606d0e7dc6b/thumb.jpg"
          ],
          "name": [
            "The Repair Shop 5x03 \"Episode 3\""
          ],
          "url": [
            "https://trakt.tv/episodes/3819830"
          ]
        },
        "value": "The Repair Shop 5x03 \"Episode 3\""
      }
    ],
    "content": [
      {
        "html": "<p>There’s a treat in store for metalworker Dominic Chinea when he comes face to face with a one-of-a-kind bicycle sidecar, designed for junior passengers. Owners Chrissy and Steve have many fond memories of peddling around town with their three children in tow, but the ingenious contraption is now dilapidated after being exiled to the shed for decades.  Furniture restorer Will Kirk is presented with the dreaded box of bits when he meets the owner of what was a Victorian sewing table. And percussion expert Pete Woods restores a piece of military history – a drum that saw frontline action in both world wars. The drum belonged to owner Tim’s grandfather, who signed up for duty in the Royal Fusiliers at just thirteen years of age. Too young to be a soldier, Tim's grandad became a drummer boy and would accompany marching soldiers.</p>\n\n                                <p style=\"font-style: italic; text-align: right;\">Watched on Trakt</p>",
        "value": "There’s a treat in store for metalworker Dominic Chinea when he comes face to face with a one-of-a-kind bicycle sidecar, designed for junior passengers. Owners Chrissy and Steve have many fond memories of peddling around town with their three children in tow, but the ingenious contraption is now dilapidated after being exiled to the shed for decades. Furniture restorer Will Kirk is presented with the dreaded box of bits when he meets the owner of what was a Victorian sewing table. And percussion expert Pete Woods restores a piece of military history – a drum that saw frontline action in both world wars. The drum belonged to owner Tim’s grandfather, who signed up for duty in the Royal Fusiliers at just thirteen years of age. Too young to be a soldier, Tim's grandad became a drummer boy and would accompany marching soldiers.\nWatched on Trakt"
      }
    ],
    "url": [
      "/2021/the-repair-shop-5x03-episode-3"
    ],
    "published": [
      "2021-04-12T02:00:02+0000"
    ],
    "post-kind": [
      "Watching"
    ],
    "post-id": [
      "e67cc9b937503d16acd7f03fbe71637e"
    ],
    "location-metadata": {
      "timestamp": "2021-04-12T01:53:47Z",
      "year": 2021,
      "month": 4,
      "day": 12,
      "hour": 1,
      "minute": 53,
      "x": -118.37038701887651,
      "y": 33.81541474974403,
      "altitude": 55,
      "motion": [
        "stationary"
      ],
      "speed": 0,
      "battery_state": "unplugged",
      "battery_level": 1,
      "wifi": "LaCour"
    }
  }
}