{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "NYTimes: Republican Hypocrisy on Iran"
    ],
    "bookmark-of": [
      "http://nytimes.com/2015/08/02/opinion/sunday/republican-hypocrisy-on-iran.html"
    ],
    "content": [
      {
        "html": "<p>The Editorial Board at the New York Times is fed up with how the Republican\nparty is responding to President Obama’s proposed deal with Iran – a difficult\nto negotiate and <em>exceedingly important</em> deal that could be torpedoed solely\nbecause the GOP doesn’t like the President.</p><p>Even more frustrating is the hypocrisy at play.</p><blockquote><p>Policy considerations aside, what is most striking about the demagoguery is\nhow ahistorical, if not downright hypocritical, it is. Negotiating with\nadversaries to advance a more stable world has long been a necessity, and\nRepublican presidents have been among its most eager practitioners.</p></blockquote><p>Obama and Kerry have worked tirelessly to come to the same type of agreement\nthat Nixon and Reagan made during their tenures. A deal which could save lives\nand is primarily about preventing war.</p>",
        "value": "The Editorial Board at the New York Times is fed up with how the Republican party is responding to President Obama’s proposed deal with Iran – a difficult to negotiate and exceedingly important deal that could be torpedoed solely because the GOP doesn’t like the President.\nEven more frustrating is the hypocrisy at play.\nPolicy considerations aside, what is most striking about the demagoguery is how ahistorical, if not downright hypocritical, it is. Negotiating with adversaries to advance a more stable world has long been a necessity, and Republican presidents have been among its most eager practitioners.\nObama and Kerry have worked tirelessly to come to the same type of agreement that Nixon and Reagan made during their tenures. A deal which could save lives and is primarily about preventing war."
      }
    ],
    "url": [
      "/2015/nytimes-republican-hypocrisy-on-iran"
    ],
    "published": [
      "2015-08-13T19:08:01+0000"
    ],
    "post-kind": [
      "Like"
    ],
    "post-id": [
      "4e3737c68095c958a09b45e9ec42d261"
    ]
  }
}