{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Lake Taupo"
    ],
    "content": [
      {
        "html": "<p>On Tuesday, my biology class combined with the geology class for a three day field trip to Lake Taupo, a volcanically active region in the center of the North Island of New Zealand.  Over the course of the three day field trip, I was able to see some beautiful landscapes.</p><p>On the first day of the trip, our bus dropped us off at the Tongariro National Park headquarters, at the location of the Ruapehu volcano.  This volcano has been active fairly recently, but we were assured that we were only going to safe spots on the mountain.  We were able to board the ski-lifts and ride to a much higher spot on the mountain, which allowed us to climb up to the top of a ridge on the opposite side of the volcano's cone.  From here, we had an excellent view of Mt. Ngauruhoe, which is the volcano used in the <em>Lord of the Rings</em> for many shots of Mt. Doom.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/taupo/ruapehu.jpg\"><img alt=\"ruapehu.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/ruapehu-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/taupo/ruapehu-snow.jpg\"><img alt=\"ruapehu-snow.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/ruapehu-snow-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr><tr><td>\n<a href=\"http://www.skinnee.net/images/taupo/ruapehu-me.jpg\"><img alt=\"ruapehu-me.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/ruapehu-me-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/taupo/doom-in-distance.jpg\"><img alt=\"doom-in-distance.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/doom-in-distance-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>The second day of our trip centered around a visit to the Mongatepopo Valley on the eastern side of the Tongariro volcanic center.  We hiked into the center of the valley, directly beneath Mt. Ngauruhoe.  This volcano is one of the youngest known volcanos in the world, being built in the last 3000 years, making it younger than the man-made pyramids.  We hiked down into the valley over the course of over an hour through rocky landscape until we reached a small waterfall at the foot of the volcano, and stopped for lunch.  From the base of the volcano, it was very easy to tell that we were standing beneath the imposing Mt. Doom!</p><p>We departed from the waterfall after an hour break and began the long, painful hike up to the \"saddle\" that separates Mt. Ngauruhoe from its neighbor.  The hike was extremely steep, very rocky, and very dangerous!  But, the hike was worth it, as we made it about halfway up to the cone of the volcano, where we could see the snowy Mt. Tongariro in the distance.  We stopped at the top of the volcano for an hour before making the long hike back to our bus.  When we arrived at the hotel, we all collapsed into our beds in exhaustion =)</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/taupo/hike-start.jpg\"><img alt=\"hike-start.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/hike-start-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/taupo/baseofmountdoom.jpg\"><img alt=\"baseofmountdoom.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/baseofmountdoom-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/taupo/meatthewaterfall.jpg\"><img alt=\"meatthewaterfall.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/meatthewaterfall-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/taupo/groupatthetop.jpg\"><img alt=\"groupatthetop.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/groupatthetop-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/taupo/meathetop.jpg\"><img alt=\"meathetop.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/taupo/meathetop-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/taupo/viewfromruapehu.jpg\"><img alt=\"viewfromruapehu.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/viewfromruapehu-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>The last day of the field trip was probably one of the most boring experiences of my life.  We visited a geothermal power station, and looked at a bunch of rocks...  the only bright point of the day was the visit to Huka Falls, which provided a beautiful view of some of the clearest water I have ever seen as it roared through a narrow valley and over the edge of a small cliff.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/taupo/viewfromquarry.jpg\"><img alt=\"viewfromquarry.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/viewfromquarry-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/taupo/baseofhukafalls.jpg\"><img alt=\"baseofhukafalls.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/taupo/baseofhukafalls-thumb.jpg\" width=\"67\"/></a>\n</td>\n</tr></tbody></table><p>My stay in Taupo was gratifying, but by the time Thursday night rolled around, I was ready to depart.  A few of us rented a car to drive home early to watch the International Rugby Sevens back in Wellington.</p>",
        "value": "On Tuesday, my biology class combined with the geology class for a three day field trip to Lake Taupo, a volcanically active region in the center of the North Island of New Zealand. Over the course of the three day field trip, I was able to see some beautiful landscapes.\nOn the first day of the trip, our bus dropped us off at the Tongariro National Park headquarters, at the location of the Ruapehu volcano. This volcano has been active fairly recently, but we were assured that we were only going to safe spots on the mountain. We were able to board the ski-lifts and ride to a much higher spot on the mountain, which allowed us to climb up to the top of a ridge on the opposite side of the volcano's cone. From here, we had an excellent view of Mt. Ngauruhoe, which is the volcano used in the Lord of the Rings for many shots of Mt. Doom. ruapehu.jpg ruapehu-snow.jpg ruapehu-me.jpg doom-in-distance.jpg\nThe second day of our trip centered around a visit to the Mongatepopo Valley on the eastern side of the Tongariro volcanic center. We hiked into the center of the valley, directly beneath Mt. Ngauruhoe. This volcano is one of the youngest known volcanos in the world, being built in the last 3000 years, making it younger than the man-made pyramids. We hiked down into the valley over the course of over an hour through rocky landscape until we reached a small waterfall at the foot of the volcano, and stopped for lunch. From the base of the volcano, it was very easy to tell that we were standing beneath the imposing Mt. Doom!\nWe departed from the waterfall after an hour break and began the long, painful hike up to the \"saddle\" that separates Mt. Ngauruhoe from its neighbor. The hike was extremely steep, very rocky, and very dangerous! But, the hike was worth it, as we made it about halfway up to the cone of the volcano, where we could see the snowy Mt. Tongariro in the distance. We stopped at the top of the volcano for an hour before making the long hike back to our bus. When we arrived at the hotel, we all collapsed into our beds in exhaustion =) hike-start.jpg baseofmountdoom.jpg meatthewaterfall.jpg groupatthetop.jpg meathetop.jpg viewfromruapehu.jpg\nThe last day of the field trip was probably one of the most boring experiences of my life. We visited a geothermal power station, and looked at a bunch of rocks... the only bright point of the day was the visit to Huka Falls, which provided a beautiful view of some of the clearest water I have ever seen as it roared through a narrow valley and over the edge of a small cliff. viewfromquarry.jpg baseofhukafalls.jpg\nMy stay in Taupo was gratifying, but by the time Thursday night rolled around, I was ready to depart. A few of us rented a car to drive home early to watch the International Rugby Sevens back in Wellington."
      }
    ],
    "url": [
      "/2003/lake-taupo"
    ],
    "published": [
      "2003-02-07T11:15:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "296de9c84adc3e7d6cc16df30b029858"
    ]
  }
}