{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "More fun in Sydney."
    ],
    "content": [
      {
        "html": "<p>Today was a fun day, as my class took a field trip to several sites.  First, we visited the Olympic Village from the 2000 Sydney Games.  This was an excellent experience, because it reminded me a lot of home.  Sydney built a gigantic brick park for the Olympics, with giant stadiums, and lots of room for sponsors.  Now, like Atlanta, they are left with a big, hot, uncomfortable park that noone uses.  Its really kind of sad!  A good experience nonetheless =)</p><p>After this, we visited Blue Mountains National Park, about 2 hours outside of Sydney.  The Blue Mountains are kind of like Sydney's answer to the Grand Canyon.  We first went to a high-level platform to view a rock formation called The Three Sisters, which is basically three large rocks jutting out from the side of a large mountain.  The formation has an aboriginal legend associated with it, and is very beautiful.</p><p>At this point, we took a hike down the Furber Steps, a trail carved into the side of the mountains that takes about 1.5 hours to hike.  We stopped at various locations to view caves, grottos, and Katooga Falls.  At the base of the mountain, we hopped onto the world's steepest inclined railway, and took a scenic train ride back up the mountain.  This was by far the coolest part of my day.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/sydney/threesisters.jpg\"><img alt=\"threesisters.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/sydney/threesisters-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/sydney/viewfromthefalls.jpg\"><img alt=\"viewfromthefalls.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/sydney/viewfromthefalls-thumb.jpg\" width=\"90\"/></a>\n</td>\n</tr></tbody></table><p>We wrapped up the day with a stop at Darwin's Walk, which is a hiking path that Charles Darwin visited years ago.  Our class is entitled \"Biology and Evolution Down Under,\" so our professor is extremely fond of Darwin, and thought that it was very important for us to walk in his footsteps.</p><p>Tonight, I am planning on heading to an internet cafe to update this journal, catch up on email, and do some browsing.  After this, I will probably stay in and read a book, since I am feeling a little under the weather.  I am having a fantastic time, and I hope that everyone is doing well back home!  I miss you all so much, and I love you all!  Lacey, hang in there, and give Winston a hug, I miss you and love you!</p><p>Also, a quick congratulations to Delta Chi on having a successful Spring Rush.  You guys rock!  Keep working hard to maintain everything we have worked for, I am proud to be associated with you.</p>\n<p><em>G'Day, and no worries mate!</em></p>",
        "value": "Today was a fun day, as my class took a field trip to several sites. First, we visited the Olympic Village from the 2000 Sydney Games. This was an excellent experience, because it reminded me a lot of home. Sydney built a gigantic brick park for the Olympics, with giant stadiums, and lots of room for sponsors. Now, like Atlanta, they are left with a big, hot, uncomfortable park that noone uses. Its really kind of sad! A good experience nonetheless =)\nAfter this, we visited Blue Mountains National Park, about 2 hours outside of Sydney. The Blue Mountains are kind of like Sydney's answer to the Grand Canyon. We first went to a high-level platform to view a rock formation called The Three Sisters, which is basically three large rocks jutting out from the side of a large mountain. The formation has an aboriginal legend associated with it, and is very beautiful.\nAt this point, we took a hike down the Furber Steps, a trail carved into the side of the mountains that takes about 1.5 hours to hike. We stopped at various locations to view caves, grottos, and Katooga Falls. At the base of the mountain, we hopped onto the world's steepest inclined railway, and took a scenic train ride back up the mountain. This was by far the coolest part of my day. threesisters.jpg viewfromthefalls.jpg\nWe wrapped up the day with a stop at Darwin's Walk, which is a hiking path that Charles Darwin visited years ago. Our class is entitled \"Biology and Evolution Down Under,\" so our professor is extremely fond of Darwin, and thought that it was very important for us to walk in his footsteps.\nTonight, I am planning on heading to an internet cafe to update this journal, catch up on email, and do some browsing. After this, I will probably stay in and read a book, since I am feeling a little under the weather. I am having a fantastic time, and I hope that everyone is doing well back home! I miss you all so much, and I love you all! Lacey, hang in there, and give Winston a hug, I miss you and love you!\nAlso, a quick congratulations to Delta Chi on having a successful Spring Rush. You guys rock! Keep working hard to maintain everything we have worked for, I am proud to be associated with you.\nG'Day, and no worries mate!"
      }
    ],
    "url": [
      "/2003/more-fun-in-sydney"
    ],
    "published": [
      "2003-01-14T05:15:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "0c403a35975b133a754329b2cbb28dcd"
    ]
  }
}