{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Beaches galore..."
    ],
    "content": [
      {
        "html": "<p>The last few days, I feel like I have visited about 10 beaches =)  Yesterday, a group of us took a bus over to Bondai Beach, which is a really great beach here in Sydney.  Its close in, urban, and has fantastic waves and fairly clean sand.  Since its an urban beach, its not quite as beautiful as, say, Moreton Bay, but it has its appeals.  I spent most of my time lying on a towel, and reading a book.  Very relaxing.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/sydney/bondaileft.jpg\"><img alt=\"bondaileft.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/bondaileft-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/sydney/bondairight.jpg\"><img alt=\"bondairight.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/bondairight-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Today, we had our second field trip in Sydney.  It started with a trip to Long Beach, about 1.5 hours outside of Sydney.  This was a <em>great</em> time, and I body surfed until I had taken in about 2 gallons of salt-water, and then sat on the beach for a while.</p><p>Following this, we headed over to the Long Reef Tidal Pools.  The tidal pools are formed by a large rocky piece of land that is underwater for all but a few hours a day during low tide.  We arrived about 10 minutes before low tide, and were able to walk on the rock and look around at the various plant and wild life.  This was really amazingly cool, and we were able to see sea urchins, sea snails, hermit crabs, and an extremely dangerous kind of octopus.  If this particular kind of octopus stings you, you will require nearly three hours of CPR just to stand a chance at survival.  Great stuff =)</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/sydney/longreeftidal.jpg\"><img alt=\"longreeftidal.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/longreeftidal-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/sydney/meatlongreef.jpg\"><img alt=\"meatlongreef.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/meatlongreef-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/sydney/morelongreef.jpg\"><img alt=\"morelongreef.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/morelongreef-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>After our experience at the tidal pools, we were taken to the North Head Beach, where we were let out for a few minutes to take pictures of Sydney from across the bay.  From our vantage point we could see the entire city, the ocean, and a bright blue sky.  It was really quite beautiful.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/sydney/viewfromnorthhead.jpg\"><img alt=\"viewfromnorthhead.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/viewfromnorthhead-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/sydney/northheadwater.jpg\"><img alt=\"northheadwater.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/northheadwater-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Just when we thought it was all over, the bus dropped us off at Manly Beach just in case any of us needed a few more hours in the unbelievably hot sun.  I elected to come back to the school to write a paper and then take a nice shower.  What a great few days, but man am I completely beached out for a while.</p><p>Tomorrow is our last day in Sydney before our bus trip to Canberra and then Melbourne on Saturday.  I am going to see the Royal Botanical Gardens, and then to the Opera House for a show.  I will blog again tomorrow night!</p>",
        "value": "The last few days, I feel like I have visited about 10 beaches =) Yesterday, a group of us took a bus over to Bondai Beach, which is a really great beach here in Sydney. Its close in, urban, and has fantastic waves and fairly clean sand. Since its an urban beach, its not quite as beautiful as, say, Moreton Bay, but it has its appeals. I spent most of my time lying on a towel, and reading a book. Very relaxing. bondaileft.jpg bondairight.jpg\nToday, we had our second field trip in Sydney. It started with a trip to Long Beach, about 1.5 hours outside of Sydney. This was a great time, and I body surfed until I had taken in about 2 gallons of salt-water, and then sat on the beach for a while.\nFollowing this, we headed over to the Long Reef Tidal Pools. The tidal pools are formed by a large rocky piece of land that is underwater for all but a few hours a day during low tide. We arrived about 10 minutes before low tide, and were able to walk on the rock and look around at the various plant and wild life. This was really amazingly cool, and we were able to see sea urchins, sea snails, hermit crabs, and an extremely dangerous kind of octopus. If this particular kind of octopus stings you, you will require nearly three hours of CPR just to stand a chance at survival. Great stuff =) longreeftidal.jpg meatlongreef.jpg morelongreef.jpg\nAfter our experience at the tidal pools, we were taken to the North Head Beach, where we were let out for a few minutes to take pictures of Sydney from across the bay. From our vantage point we could see the entire city, the ocean, and a bright blue sky. It was really quite beautiful. viewfromnorthhead.jpg northheadwater.jpg\nJust when we thought it was all over, the bus dropped us off at Manly Beach just in case any of us needed a few more hours in the unbelievably hot sun. I elected to come back to the school to write a paper and then take a nice shower. What a great few days, but man am I completely beached out for a while.\nTomorrow is our last day in Sydney before our bus trip to Canberra and then Melbourne on Saturday. I am going to see the Royal Botanical Gardens, and then to the Opera House for a show. I will blog again tomorrow night!"
      }
    ],
    "url": [
      "/2003/beaches-galore"
    ],
    "published": [
      "2003-01-16T04:41:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "50f7a2678b638b38396e52b0bd154d51"
    ]
  }
}