{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Mt. Victoria ... \"Get off the road!\""
    ],
    "content": [
      {
        "html": "<p>I slept in today, and woke up at 10:00 AM feeling refreshed.  I met a group of friends, and we decided to hike to the top of Mt. Victoria, which rises up from the edge of Wellington, and overlooks the surrounding area.  We caught the cable car down into the city, and started our trek toward the mountain.  Along the way, we walked past The Embassy Theatre, where I had seen <em>The Lord of the Rings: The Two Towers</em> a few days before.  I have included a picture of this very cool theater below.</p><p>After about a 30 minute walk, we found the base of the mountain, and began climbing on the path.  Today in Wellington, it was quite windy, with gusts of up to 55 mph.  This proved to make our journey quite difficult =)  We climbed up the trail for over an hour, and eventually reached a lookout at the top of the mountain.  The view was absolutely incredible, and I took a panoramic shot (composed of 14 images) with my digital camera (Adobe PhotoStitch is awesome).</p>\n<p></p><center><br/><a href=\"http://www.skinnee.net/images/wellington/mtvictoriapano-small.jpg\"><img alt=\"mtvictoriapano-small.jpg\" border=\"0\" height=\"42\" src=\"http://www.skinnee.net/images/wellington/mtvictoriapano-small-thumb.jpg\" width=\"460\"/></a><br/></center><p></p>\n<table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/theembassy.jpg\"><img alt=\"theembassy.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/theembassy-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/meinthewind.jpg\"><img alt=\"meinthewind.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/meinthewind-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/everyoneinthewind.jpg\"><img alt=\"everyoneinthewind.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/everyoneinthewind-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/meathelookout.jpg\"><img alt=\"meathelookout.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/meathelookout-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/usatopvictoria.jpg\"><img alt=\"usatopvictoria.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/usatopvictoria-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>On our walk down the mountain, we used my <em>Lord of the Rings Location Guidebook</em> to track down a few spots that appeared in the films.  The directions were pretty bad, but we were able to find a great location from the first film.  Early in the film, after the hobbits have left for Rivendell, they are on the edges of the Shire, and are on a path trying to avoid black riders.  At a certain point, Frodo goes onto the trail and the camera pans onto him as he says \"get off the road!\"  We found this spot!  Very cool stuff... Dad, I am sure you are jealous!</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/lotr_stayofftheroad2.jpg\"><img alt=\"lotr_stayofftheroad2.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/lotr_stayofftheroad2-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/lotr_stayofftheroad.jpg\"><img alt=\"lotr_stayofftheroad.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/lotr_stayofftheroad-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Well, I am still having a great time here in Wellington, and I hope to blog at you more later!  This tiny little city is packed chock full of fun!</p>",
        "value": "I slept in today, and woke up at 10:00 AM feeling refreshed. I met a group of friends, and we decided to hike to the top of Mt. Victoria, which rises up from the edge of Wellington, and overlooks the surrounding area. We caught the cable car down into the city, and started our trek toward the mountain. Along the way, we walked past The Embassy Theatre, where I had seen The Lord of the Rings: The Two Towers a few days before. I have included a picture of this very cool theater below.\nAfter about a 30 minute walk, we found the base of the mountain, and began climbing on the path. Today in Wellington, it was quite windy, with gusts of up to 55 mph. This proved to make our journey quite difficult =) We climbed up the trail for over an hour, and eventually reached a lookout at the top of the mountain. The view was absolutely incredible, and I took a panoramic shot (composed of 14 images) with my digital camera (Adobe PhotoStitch is awesome).\n\nmtvictoriapano-small.jpg \n\n theembassy.jpg meinthewind.jpg everyoneinthewind.jpg meathelookout.jpg usatopvictoria.jpg\nOn our walk down the mountain, we used my Lord of the Rings Location Guidebook to track down a few spots that appeared in the films. The directions were pretty bad, but we were able to find a great location from the first film. Early in the film, after the hobbits have left for Rivendell, they are on the edges of the Shire, and are on a path trying to avoid black riders. At a certain point, Frodo goes onto the trail and the camera pans onto him as he says \"get off the road!\" We found this spot! Very cool stuff... Dad, I am sure you are jealous! lotr_stayofftheroad2.jpg lotr_stayofftheroad.jpg\nWell, I am still having a great time here in Wellington, and I hope to blog at you more later! This tiny little city is packed chock full of fun!"
      }
    ],
    "url": [
      "/2003/mt-victoria-get-off-the-road"
    ],
    "published": [
      "2003-01-31T23:57:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "133a9070ae6562b921198496459b8c8f"
    ]
  }
}