{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Arrived in ChristChurch"
    ],
    "content": [
      {
        "html": "<p>My last evening in Wellington was wonderful.  We first went to a small brewery in the middle of the city and sat on the balcony — very fun.  We then walked down to Courtenay Place, the center of night life in Wellington, and relaxed in a few pubs and bars.  Then we walked up into the Botanic Gardens, just above the Weir House, and climbed a tree known to the locals as the \"bucket tree.\"  The tree is very dense, and is carefully trimmed to a large cylindrical shape with a flat top.  Because of its trimming and density, you can climb to the top of it, about twenty-five feet off the ground and on the crest of the highest hill in the gardens, and you can lay down on the flat canopy of the branches.  We stayed in the tree until around 4:00 AM and then walked back down to the dorm to catch a few hours of sleep before our bus departed at 8:30 AM.</p><p>I woke up at about 7:30 AM absolutely exhausted, hurriedly packed my stuff, and boarded the bus for the airport.  We then boarded a tiny dual-prop plane for our short hop flight from Wellington to ChristChurch.  We are staying in a very nice hotel near the center of the city.  It only has one computer in the business center, which is hooked up into a modem for internet access — I will have very limited access to email and the web.  The plus side is that the food is great and will be a wonderful change from my selections at the Weir House in Wellington.  So far, I like it here in ChristChurch.  The city is much different than Wellington in that it is flat, spread out, and full of gardens and parks.  It makes sense that I am studying Victorian literature and culture here, since the entire city feels like an old English city.</p><p>On the other hand, I really miss Wellington already.  I grew very attached to the place in such a short time, and I will really miss the wonderful people I had the opportunity to see there, and the amazing and beautiful landscape of the city.</p><p>I have already planned out my two weekends here, and I am really looking forward to them.  This weekend, 12 of us are renting a giant van and driving across the island through the Southern Alps to climb and hike on the Franz Josef glacier and possibly go to sail in the fiord-lands.  We will then drive back and go to the Canterbury vs. Wellington rugby match in ChristChurch.  Next weekend, a few of us are going to rent a car and drive to Queenstown, the adventure capital of the world.  Most people will be skydiving or bungy jumping, but I am not really interested in those things... a bit too dangerous =)  We are going to go jet-boating down the fiords, ride a helicopter into a canyon, and possibly go white water rafting.  Then we will be headed back to Australia for 2 days to snorkel in the Great Barrier Reef.  I have a lot to look forward to!</p><p>I will update you all soon on how much I am enjoying ChristChurch!  I love you and miss you all!</p>",
        "value": "My last evening in Wellington was wonderful. We first went to a small brewery in the middle of the city and sat on the balcony — very fun. We then walked down to Courtenay Place, the center of night life in Wellington, and relaxed in a few pubs and bars. Then we walked up into the Botanic Gardens, just above the Weir House, and climbed a tree known to the locals as the \"bucket tree.\" The tree is very dense, and is carefully trimmed to a large cylindrical shape with a flat top. Because of its trimming and density, you can climb to the top of it, about twenty-five feet off the ground and on the crest of the highest hill in the gardens, and you can lay down on the flat canopy of the branches. We stayed in the tree until around 4:00 AM and then walked back down to the dorm to catch a few hours of sleep before our bus departed at 8:30 AM.\nI woke up at about 7:30 AM absolutely exhausted, hurriedly packed my stuff, and boarded the bus for the airport. We then boarded a tiny dual-prop plane for our short hop flight from Wellington to ChristChurch. We are staying in a very nice hotel near the center of the city. It only has one computer in the business center, which is hooked up into a modem for internet access — I will have very limited access to email and the web. The plus side is that the food is great and will be a wonderful change from my selections at the Weir House in Wellington. So far, I like it here in ChristChurch. The city is much different than Wellington in that it is flat, spread out, and full of gardens and parks. It makes sense that I am studying Victorian literature and culture here, since the entire city feels like an old English city.\nOn the other hand, I really miss Wellington already. I grew very attached to the place in such a short time, and I will really miss the wonderful people I had the opportunity to see there, and the amazing and beautiful landscape of the city.\nI have already planned out my two weekends here, and I am really looking forward to them. This weekend, 12 of us are renting a giant van and driving across the island through the Southern Alps to climb and hike on the Franz Josef glacier and possibly go to sail in the fiord-lands. We will then drive back and go to the Canterbury vs. Wellington rugby match in ChristChurch. Next weekend, a few of us are going to rent a car and drive to Queenstown, the adventure capital of the world. Most people will be skydiving or bungy jumping, but I am not really interested in those things... a bit too dangerous =) We are going to go jet-boating down the fiords, ride a helicopter into a canyon, and possibly go white water rafting. Then we will be headed back to Australia for 2 days to snorkel in the Great Barrier Reef. I have a lot to look forward to!\nI will update you all soon on how much I am enjoying ChristChurch! I love you and miss you all!"
      }
    ],
    "url": [
      "/2003/arrived-in-christchurch"
    ],
    "published": [
      "2003-02-16T23:03:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "97814c993116d68bbde162ec2b49e034"
    ]
  }
}