{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Field trips and recklessness"
    ],
    "content": [
      {
        "html": "<p>Yesterday, my Biology class went on another field trip, this time to the Australian Zoo (home of the <i>\"Crocodile Hunter\"</i> Steve Irwin), and to another beach at Noosa Head.  This field trip was much less interesting than the last, but had a few bright spots.</p><p>After a short bus trip, we were dropped off at the Glass House Mountain range just outside Brisbane.  We parked just next to a giant pineapple field, and there was a merchant on the side of the road selling fresh mangoes and lychees.  I had never had a lychee before, so I bought a few, and really liked them.  They are a small, red fruit with bumps all over them, and when peeled they reveal a tender, juicy, white flesh that tastes very similar to red grapes.</p><p>Following our short stop at the pineapple field, we reboarded the bus and headed back in the direction of the Australian Zoo, which I must say I found very disappointing.  I saw only a few animals that I had not already seen the previous day, and found the crocodile presentation to be a little slow and overrated.  Besides... Steve Irwin wasn't there, and that was kind of the point of the whole trip.  However, I did get to see the most venomous snake in the world and a northern reticulated python, which is a ridiculously large snake.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/brisbane/mountain.jpg\"><img alt=\"mountain.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/mountain-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/coolbird.jpg\"><img alt=\"coolbird.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/brisbane/coolbird-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/lychee.jpg\"><img alt=\"lychee.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/lychee-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>After departing the zoo, the bus dropped us off in Noosa Head, another beach near Brisbane that is a bit less touristy than Surfer's Paradise.  My first impression of the beach was not very good... there were no waves at all, very few people, lots of seaweed, and not much to do.  After doing a little exploration, a group of us found a private beach nearby that was breathtakingly beautiful and we spent most of our time at Noosa Head on this beach.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/brisbane/noosaview.jpg\"><img alt=\"noosaview.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/noosaview-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/noosatree.jpg\"><img alt=\"noosatree.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/noosatree-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/noosaprivate.jpg\"><img alt=\"noosaprivate.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/noosaprivate-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>After the field trip, pretty much the entire population of the trip took a bus into town for a night of fun at the local bars.  We first visited The Victory Hotel, which was packed, had two for one drinks upstairs, and a live band out in the open air of Brisbane—very cool.  At one point the band broke out into <em>Sweet Home Alabama</em>, which we all found pretty amusing =).  After this we headed over to The Regatta, a smaller and classier bar near the college that was nearly empty and was very overpriced...</p><p>We found out the next morning that two people from our trip had been sent to the emergency room for drinking too much, but the good news is that both are fine and required no treatment.  It amazes me how often people can lose track of their drinking when their body is telling them all along to stop... oh well.</p><p>Things are still going well, as I am about to head out to the Queensland Museum and back to the Botanical Gardens with a few folks from class.  Tomorrow is the big day spent in Moreton Bay, and I will be sure to send an update as soon as possible on this experience!</p>",
        "value": "Yesterday, my Biology class went on another field trip, this time to the Australian Zoo (home of the \"Crocodile Hunter\" Steve Irwin), and to another beach at Noosa Head. This field trip was much less interesting than the last, but had a few bright spots.\nAfter a short bus trip, we were dropped off at the Glass House Mountain range just outside Brisbane. We parked just next to a giant pineapple field, and there was a merchant on the side of the road selling fresh mangoes and lychees. I had never had a lychee before, so I bought a few, and really liked them. They are a small, red fruit with bumps all over them, and when peeled they reveal a tender, juicy, white flesh that tastes very similar to red grapes.\nFollowing our short stop at the pineapple field, we reboarded the bus and headed back in the direction of the Australian Zoo, which I must say I found very disappointing. I saw only a few animals that I had not already seen the previous day, and found the crocodile presentation to be a little slow and overrated. Besides... Steve Irwin wasn't there, and that was kind of the point of the whole trip. However, I did get to see the most venomous snake in the world and a northern reticulated python, which is a ridiculously large snake. mountain.jpg coolbird.jpg lychee.jpg\nAfter departing the zoo, the bus dropped us off in Noosa Head, another beach near Brisbane that is a bit less touristy than Surfer's Paradise. My first impression of the beach was not very good... there were no waves at all, very few people, lots of seaweed, and not much to do. After doing a little exploration, a group of us found a private beach nearby that was breathtakingly beautiful and we spent most of our time at Noosa Head on this beach. noosaview.jpg noosatree.jpg noosaprivate.jpg\nAfter the field trip, pretty much the entire population of the trip took a bus into town for a night of fun at the local bars. We first visited The Victory Hotel, which was packed, had two for one drinks upstairs, and a live band out in the open air of Brisbane—very cool. At one point the band broke out into Sweet Home Alabama, which we all found pretty amusing =). After this we headed over to The Regatta, a smaller and classier bar near the college that was nearly empty and was very overpriced...\nWe found out the next morning that two people from our trip had been sent to the emergency room for drinking too much, but the good news is that both are fine and required no treatment. It amazes me how often people can lose track of their drinking when their body is telling them all along to stop... oh well.\nThings are still going well, as I am about to head out to the Queensland Museum and back to the Botanical Gardens with a few folks from class. Tomorrow is the big day spent in Moreton Bay, and I will be sure to send an update as soon as possible on this experience!"
      }
    ],
    "url": [
      "/2003/field-trips-and-recklessness"
    ],
    "published": [
      "2003-01-09T22:12:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "f3ed935d030c596a635dc380e4099295"
    ]
  }
}