{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Farewell to NZ, Cairns, and preparing for Japan"
    ],
    "content": [
      {
        "html": "<p>Saturday morning, we departed New Zealand for one last visit to Australia, and then to travel to Japan for our last three weeks of the trip.  New Zealand was an absolutely amazing place, and I hope to be able to return one day.  For a country of just over 4 million people, the Kiwis have accomplished so much on the world stage in sport, science, art, and culture.  Their contribution to the world greatly outmatches their population size, and I was extremely impressed by the people.  Kiwis are some of the nicest folks that I have ever met, and are intensely proud of their small country — and who could blame them?  Where else can you climb glaciers, hang glide, climb mountains, see volcanoes, attend rugby championships, visit beautiful beaches, and see some of the most gorgeous landscapes that the world has to offer?  I will truly miss New Zealand!</p><p>We left ChristChurch in the morning and arrived in Cairns late in the afternoon.  I ate dinner on the plane, and collapsed in my hotel room early in the evening.  We woke up in time to catch a cab to the Pier for our trip to see the Great Barrier Reef.  Before we boarded the boat, I made sure to take several ginger tablets to prevent sea sickness (I learned that lesson the hard way on my trip to <a href=\"http://www.skinnee.net/archives/000013.html\">Moreton Bay</a>).  This worked very well, and after a beautiful 90 minute boat ride, we arrived at our diving location on the Great Barrier Reef.</p><p>We were given wetsuits, flippers, and snorkels, and were able to freeley snorkel for several hours at a time at two different locations on the reef.  I had been snorkeling on reefs before, but nothing compares to the beauty of the Great Barrier Reef.  The scale is simply impossible to explain — its just huge.  The fish on the reef are some of the most exotic and beautiful fish I have ever seen, and we also were able to see and touch several sea turtles.  My experience on the reef was wonderful, and I truly enjoyed it!  Unfortunately, I neglected to charge my batteries in my camera, and was unable to take any pictures, so I am going to have to make this entry pictureless!</p><p>That evening, we went out to dinner at a very nice restaurant called the Raw Prawn.  I ordered a dish with several different kinds of seafood, and some of the best fried shrimp that I have ever tasted (next to my grandfather's amazing fried shrimp, of course).  The other people at my table all ordered a dish called the <em>Hop, Skip, Hump, and Jump</em>, which is an Australian favorite featuring portions of grilled kangaroo (hop), crocodile (skip), hump (camel), and jump (ostrich).  I was able to try some of each, and all of them were absolutely fantastic.  The waiter took a particular liking to us, and gave us free port wines and discounted desserts.  I ordered a beautiful dessert called the Chocolate Extreme (Lacey, you would have <em>adored</em> this).</p><p>We then went out on the town for a while, and took part in $5.00 AUD jugs of Victoria Bitter (translation: $2.75 USD pitchers of Bass).  I turned in early after a very satisfying evening!</p><p>I am now sitting on an 8 hour flight to Osaka, Japan, and am preparing for a bit of culture shock.  Already, our food on the plane was very different from what I am used to, and I am hoping that I will be able to cope with all of the differences!  Well, thats all for now, I love you and miss you all, and I will be sure to update this journal with some pictures of Japan as soon as I get the chance!</p>",
        "value": "Saturday morning, we departed New Zealand for one last visit to Australia, and then to travel to Japan for our last three weeks of the trip. New Zealand was an absolutely amazing place, and I hope to be able to return one day. For a country of just over 4 million people, the Kiwis have accomplished so much on the world stage in sport, science, art, and culture. Their contribution to the world greatly outmatches their population size, and I was extremely impressed by the people. Kiwis are some of the nicest folks that I have ever met, and are intensely proud of their small country — and who could blame them? Where else can you climb glaciers, hang glide, climb mountains, see volcanoes, attend rugby championships, visit beautiful beaches, and see some of the most gorgeous landscapes that the world has to offer? I will truly miss New Zealand!\nWe left ChristChurch in the morning and arrived in Cairns late in the afternoon. I ate dinner on the plane, and collapsed in my hotel room early in the evening. We woke up in time to catch a cab to the Pier for our trip to see the Great Barrier Reef. Before we boarded the boat, I made sure to take several ginger tablets to prevent sea sickness (I learned that lesson the hard way on my trip to Moreton Bay). This worked very well, and after a beautiful 90 minute boat ride, we arrived at our diving location on the Great Barrier Reef.\nWe were given wetsuits, flippers, and snorkels, and were able to freeley snorkel for several hours at a time at two different locations on the reef. I had been snorkeling on reefs before, but nothing compares to the beauty of the Great Barrier Reef. The scale is simply impossible to explain — its just huge. The fish on the reef are some of the most exotic and beautiful fish I have ever seen, and we also were able to see and touch several sea turtles. My experience on the reef was wonderful, and I truly enjoyed it! Unfortunately, I neglected to charge my batteries in my camera, and was unable to take any pictures, so I am going to have to make this entry pictureless!\nThat evening, we went out to dinner at a very nice restaurant called the Raw Prawn. I ordered a dish with several different kinds of seafood, and some of the best fried shrimp that I have ever tasted (next to my grandfather's amazing fried shrimp, of course). The other people at my table all ordered a dish called the Hop, Skip, Hump, and Jump, which is an Australian favorite featuring portions of grilled kangaroo (hop), crocodile (skip), hump (camel), and jump (ostrich). I was able to try some of each, and all of them were absolutely fantastic. The waiter took a particular liking to us, and gave us free port wines and discounted desserts. I ordered a beautiful dessert called the Chocolate Extreme (Lacey, you would have adored this).\nWe then went out on the town for a while, and took part in $5.00 AUD jugs of Victoria Bitter (translation: $2.75 USD pitchers of Bass). I turned in early after a very satisfying evening!\nI am now sitting on an 8 hour flight to Osaka, Japan, and am preparing for a bit of culture shock. Already, our food on the plane was very different from what I am used to, and I am hoping that I will be able to cope with all of the differences! Well, thats all for now, I love you and miss you all, and I will be sure to update this journal with some pictures of Japan as soon as I get the chance!"
      }
    ],
    "url": [
      "/2003/farewell-to-nz-cairns-and-preparing-for-japan"
    ],
    "published": [
      "2003-03-10T17:25:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "d596b1b1b0c40a9126f19582417aea8e"
    ]
  }
}