{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Long day..."
    ],
    "content": [
      {
        "html": "<p>Today was a long day....  I am attempting to get Lacey a puppy for Christmas to keep her company while I am away, and its not the easiest thing in the world.  All of the adoption centers have this high and mighty attitude like they don't even want you to adopt the dogs.  This one woman in particular at an Atlanta pet adoption center decided that we were not good candidates for adoption because we were students.  </p><p>Ah, yes, of *course* well-educated people that will have real jobs (not at a pet adoption center) are absolutely bad pet owners.  Without a doubt.  Better give that puppy to a soccer mom with annoying children to terrorize the poor thing.  Ah, well, looks like we will just have to take the capitalist route and purchase a puppy.  Serves us right for wanting to give an abandoned pet a new home.</p><blockquote>\n<p>\"It has been said that man is a rational animal. All my life I have been searching for evidence which could support this.\"<br/>   - <b>Bertrand Russell</b> (1872 - 1970)</p>\n</blockquote><p>So, blog updates.  As you can tell, this site will *not* be hosted at <a class=\"u-in-reply-to\" href=\"http://blog.skinnee.net/\" rel=\"in-reply-to\" target=\"_blank\">http://<wbr/>blog.skinnee.net/<wbr/></a>, and will instead be hosted at <a class=\"u-in-reply-to\" href=\"http://www.skinnee.net/\" rel=\"in-reply-to\" target=\"_blank\">http://<wbr/>www.skinnee.net/<wbr/></a> for now.  Why is that you say?  Well, sadly enough, I cannot figure out the blasted web-interface to my DNS server for the life of me.  I am getting worried that uploading the entire directory structure to the site once or twice a week might end up being a bit difficult down under, as it will be inflating to rather large sizes quite quickly with all of the pictures.  I need to figure out a way to only upload changes.  I smell some python on the horizon... sleep time!</p>",
        "value": "Today was a long day.... I am attempting to get Lacey a puppy for Christmas to keep her company while I am away, and its not the easiest thing in the world. All of the adoption centers have this high and mighty attitude like they don't even want you to adopt the dogs. This one woman in particular at an Atlanta pet adoption center decided that we were not good candidates for adoption because we were students. \nAh, yes, of *course* well-educated people that will have real jobs (not at a pet adoption center) are absolutely bad pet owners. Without a doubt. Better give that puppy to a soccer mom with annoying children to terrorize the poor thing. Ah, well, looks like we will just have to take the capitalist route and purchase a puppy. Serves us right for wanting to give an abandoned pet a new home.\n\"It has been said that man is a rational animal. All my life I have been searching for evidence which could support this.\"\n- Bertrand Russell (1872 - 1970)\nSo, blog updates. As you can tell, this site will *not* be hosted at http://blog.skinnee.net/, and will instead be hosted at http://www.skinnee.net/ for now. Why is that you say? Well, sadly enough, I cannot figure out the blasted web-interface to my DNS server for the life of me. I am getting worried that uploading the entire directory structure to the site once or twice a week might end up being a bit difficult down under, as it will be inflating to rather large sizes quite quickly with all of the pictures. I need to figure out a way to only upload changes. I smell some python on the horizon... sleep time!"
      }
    ],
    "in-reply-to": [
      "http://blog.skinnee.net/",
      "http://www.skinnee.net/"
    ],
    "url": [
      "/2002/long-day"
    ],
    "published": [
      "2002-12-22T02:02:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "f574c920894c21c12b1140057014d875"
    ]
  }
}