{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Departing Melbourne"
    ],
    "content": [
      {
        "html": "<p>Friday afternoon, a group of us rented a car to visit the famous <i>Little Penguin Parade</i> on Phillips Island.  We departed Melbourne around 2:00 PM and, after a short period of adjusting to the roundabouts, left handed driving, and the world's oddest right-hand turns, we were on our way.  In Melbourne they have a light-rail system with high levels of coverage, meaning that most streets have two rail cars (<em>trams</em>) running directly down the center.  In order to make right hand turns and avoid the trams, the city of Melbourne concocted a very strange system in which you must pull to the far <em>left</em> lane of the road and wait for the green light that you are at to turn <em>red</em> before you turn right across the oncoming traffic.  Needless to say, this takes some getting used to.</p><p>On the way to the island, we stopped at the Gurdie Winery, which is one of some dozen odd wineries along the highway.  We were delighted to find that they gave free tours and wine tastings.  Being a good sport, I tried everything that they had, and found that I really enjoy Muscat, which is similar to port wine, but is flavored with raisins, apricots, and other dried fruits.  On the way out, we purchased a fresh bottle of their excellent Cabernet for $10 AUD (about $6.00 US).</p><p>We arrived in Phillips Island around 5:30 and stopped at a stone grill restaurant to have a bite to eat.  I ordered a seafood special with mussels, calamari, shrimp, fish, and clams.  The food arrives raw on a piping hot lava rock and cooks in front of you to your taste.  The food was fairly good, but the restaurant reminded me a lot of American fondue restaurants that wow you with boiling pots of dangerous oil, broth, and cheese and then charge you $35 for about 5 ounces of steak that you have to cook yourself.  Regardless, stone grills are an experience worth having once, but probably not worth repeating.</p><p>After dinner, we headed out to watch the little penguins.  Around sunset each night, about 60,000 football sized penguins waddle in from the ocean to feed their young.  We were stationed on a boardwalk about 100 yards from the ocean and were able to see them as they waddled past.  These animals are the single cutest little buggers you will ever see.  Its like a giant bizarre cocktail party as thousands of little tuxedo adorned footballs emerge from the ocean, fighting, falling over, and then proceed waddling to their nests.  This was a great experience, but we were unfortunately not allowed to take pictures.</p><p>We left the island around 11:00 PM and arrived back in Melbourne around 1:30 AM.  I slept until noon on Saturday, did my laundry, and packed up my things and am currently in the air en-route to Wellington, New Zealand.  I truly enjoyed my stay in Australia, and I have high hopes for New Zealand.  I am not sure if we will have an internet connection in Wellington, or about the availability of internet cafes, so it may be a while until I update the blog.</p><p>I leave you with one quick picture that summarizes my last few days in Australia.</p>\n<p></p><center><a href=\"http://www.skinnee.net/images/melbourne/weathercomparison.jpg\"><img alt=\"weathercomparison.jpg\" border=\"0\" height=\"201\" src=\"http://www.skinnee.net/images/melbourne/weathercomparison-thumb.jpg\" width=\"300\"/></a></center><p></p>\n<p>The above is a weather forecast comparing Atlanta and Melbourne a few days ago.  Note that today in Melbourne, it reached a record high 44 degrees Celsius.  If my calculations are correct that is approximately 111 degrees Ferenheit.  Winter in hell is slightly colder than summer in Melbourne.  Man, I love this country!</p><p>I miss and love you all!</p>",
        "value": "Friday afternoon, a group of us rented a car to visit the famous Little Penguin Parade on Phillips Island. We departed Melbourne around 2:00 PM and, after a short period of adjusting to the roundabouts, left handed driving, and the world's oddest right-hand turns, we were on our way. In Melbourne they have a light-rail system with high levels of coverage, meaning that most streets have two rail cars (trams) running directly down the center. In order to make right hand turns and avoid the trams, the city of Melbourne concocted a very strange system in which you must pull to the far left lane of the road and wait for the green light that you are at to turn red before you turn right across the oncoming traffic. Needless to say, this takes some getting used to.\nOn the way to the island, we stopped at the Gurdie Winery, which is one of some dozen odd wineries along the highway. We were delighted to find that they gave free tours and wine tastings. Being a good sport, I tried everything that they had, and found that I really enjoy Muscat, which is similar to port wine, but is flavored with raisins, apricots, and other dried fruits. On the way out, we purchased a fresh bottle of their excellent Cabernet for $10 AUD (about $6.00 US).\nWe arrived in Phillips Island around 5:30 and stopped at a stone grill restaurant to have a bite to eat. I ordered a seafood special with mussels, calamari, shrimp, fish, and clams. The food arrives raw on a piping hot lava rock and cooks in front of you to your taste. The food was fairly good, but the restaurant reminded me a lot of American fondue restaurants that wow you with boiling pots of dangerous oil, broth, and cheese and then charge you $35 for about 5 ounces of steak that you have to cook yourself. Regardless, stone grills are an experience worth having once, but probably not worth repeating.\nAfter dinner, we headed out to watch the little penguins. Around sunset each night, about 60,000 football sized penguins waddle in from the ocean to feed their young. We were stationed on a boardwalk about 100 yards from the ocean and were able to see them as they waddled past. These animals are the single cutest little buggers you will ever see. Its like a giant bizarre cocktail party as thousands of little tuxedo adorned footballs emerge from the ocean, fighting, falling over, and then proceed waddling to their nests. This was a great experience, but we were unfortunately not allowed to take pictures.\nWe left the island around 11:00 PM and arrived back in Melbourne around 1:30 AM. I slept until noon on Saturday, did my laundry, and packed up my things and am currently in the air en-route to Wellington, New Zealand. I truly enjoyed my stay in Australia, and I have high hopes for New Zealand. I am not sure if we will have an internet connection in Wellington, or about the availability of internet cafes, so it may be a while until I update the blog.\nI leave you with one quick picture that summarizes my last few days in Australia.\nweathercomparison.jpg\n\nThe above is a weather forecast comparing Atlanta and Melbourne a few days ago. Note that today in Melbourne, it reached a record high 44 degrees Celsius. If my calculations are correct that is approximately 111 degrees Ferenheit. Winter in hell is slightly colder than summer in Melbourne. Man, I love this country!\nI miss and love you all!"
      }
    ],
    "url": [
      "/2003/departing-melbourne"
    ],
    "published": [
      "2003-01-26T13:37:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "fe42a54419a06f7d07e4e17055e23e57"
    ]
  }
}