{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Life is good!"
    ],
    "content": [
      {
        "html": "<p>Well, its been a long time since I have updated this site, and I apologize for that.  I have been back in the country over a month now, and a lot has happened.  Most of it can be summarized by the following picture.</p>\n<p></p><center><a href=\"http://www.skinnee.net/images/graduation/jongrad-small.jpeg\"><img alt=\"jongrad-small-thumb.jpeg\" border=\"0\" height=\"546\" src=\"http://www.skinnee.net/images/graduation/jongrad-small-thumb.jpeg\" width=\"420\"/></a></center><p></p>\n<p>It finally happened.  After five hard years of work at Georgia Tech, I have finally graduated.  I received a Bachelors of Science in Computer Science, graduating with Highest Honor under the Cooperative Plan.  I have had a great time at Georgia Tech, in spite of the school itself.</p><p>Reflecting on my time at Georgia Tech, I can truly say that I do not regret a single moment of my time there, and while it was difficult, even smothering at times, it was a rewarding experience that I wouldn't trade for anything.  I have heard Georgia Tech referred to as an <i>\"intellectual boot camp\"</i> many times before, and I must say that the description fits.  Georgia Tech can be a punishing place, and many times you can feel like it has beaten you.  But, when you leave, you look up at the Tech Tower and truly believe that you can accomplish anything.</p><p>What made it worthwhile, you say?  Well, that question is easy to answer—my friends.  In my five years at Georgia Tech, I have had the pleasure of meeting some of the greatest friends a guy could ask for.  These people have shaped my life, and through their greatness they have made me a better man.  When I say these things, I am mostly speaking of my brothers in Delta Chi.  Don't believe the stereotypes—true fraternity is a huge blessing.</p><p>So, what now, you ask?  I accepted a full-time position with my co-op company, <a href=\"http://www.vertisoft.com\">VertiSoft</a>, and started a few weeks ago.  VertiSoft is a medical software company based out of Roswell, GA that delivers one of the most innovative and useful software suites in the business.  The company is currently evolving and is rapidly becoming an excellent company.  I do not have any official titles, but I work in the software development side of the business, and am currently working on research and development for a new and exciting project.</p><p>In summary, <em>life is good.</em></p>",
        "value": "Well, its been a long time since I have updated this site, and I apologize for that. I have been back in the country over a month now, and a lot has happened. Most of it can be summarized by the following picture.\njongrad-small-thumb.jpeg\n\nIt finally happened. After five hard years of work at Georgia Tech, I have finally graduated. I received a Bachelors of Science in Computer Science, graduating with Highest Honor under the Cooperative Plan. I have had a great time at Georgia Tech, in spite of the school itself.\nReflecting on my time at Georgia Tech, I can truly say that I do not regret a single moment of my time there, and while it was difficult, even smothering at times, it was a rewarding experience that I wouldn't trade for anything. I have heard Georgia Tech referred to as an \"intellectual boot camp\" many times before, and I must say that the description fits. Georgia Tech can be a punishing place, and many times you can feel like it has beaten you. But, when you leave, you look up at the Tech Tower and truly believe that you can accomplish anything.\nWhat made it worthwhile, you say? Well, that question is easy to answer—my friends. In my five years at Georgia Tech, I have had the pleasure of meeting some of the greatest friends a guy could ask for. These people have shaped my life, and through their greatness they have made me a better man. When I say these things, I am mostly speaking of my brothers in Delta Chi. Don't believe the stereotypes—true fraternity is a huge blessing.\nSo, what now, you ask? I accepted a full-time position with my co-op company, VertiSoft, and started a few weeks ago. VertiSoft is a medical software company based out of Roswell, GA that delivers one of the most innovative and useful software suites in the business. The company is currently evolving and is rapidly becoming an excellent company. I do not have any official titles, but I work in the software development side of the business, and am currently working on research and development for a new and exciting project.\nIn summary, life is good."
      }
    ],
    "url": [
      "/2003/life-is-good"
    ],
    "published": [
      "2003-05-12T12:44:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "2ab143b37a1adb1cdf508a10670a4c91"
    ]
  }
}