{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Reflections: Brisbane"
    ],
    "content": [
      {
        "html": "<p>Brisbane is an amazing city.  Even though it is the first city that I have visited in Australia, I am fairly confident that it will be my favorite.  The city has a nearly ideal combination of my favorite parts of a city all rolled into one.  Brisbane is near the beach, has a vibrant downtown bubbling with activity, boats one of the finest public transit systems that I have ever seen, and sits directly on a beautiful river.  On top of this, the city has the most attractive outdoor public spaces in the world, including the Brisbane Botanical Gardens, and the South Bank outdoor market.  It also has a fantastic cultural base with a popular Performing Arts Center, an excellent natural history museum, and some decent sports teams.</p><p>All in all, I adored Brisbane, and I would love to visit again.  I will talk to you soon from Sydney!</p><p><em>No worries mate!</em></p>",
        "value": "Brisbane is an amazing city. Even though it is the first city that I have visited in Australia, I am fairly confident that it will be my favorite. The city has a nearly ideal combination of my favorite parts of a city all rolled into one. Brisbane is near the beach, has a vibrant downtown bubbling with activity, boats one of the finest public transit systems that I have ever seen, and sits directly on a beautiful river. On top of this, the city has the most attractive outdoor public spaces in the world, including the Brisbane Botanical Gardens, and the South Bank outdoor market. It also has a fantastic cultural base with a popular Performing Arts Center, an excellent natural history museum, and some decent sports teams.\nAll in all, I adored Brisbane, and I would love to visit again. I will talk to you soon from Sydney!\nNo worries mate!"
      }
    ],
    "url": [
      "/2003/reflections-brisbane"
    ],
    "published": [
      "2003-01-12T02:16:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "6e08df893ca9b110cdafe3a3f7ad5ea7"
    ]
  }
}