{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "url": [
      "/2017/roasted-spatchcocked-chicken-with-potatoes-and-onions"
    ],
    "published": [
      "2017-04-06T03:18:27+0000"
    ],
    "comment": [
      {
        "type": [
          "h-cite"
        ],
        "properties": {
          "summary": [
            "Looks tasty!"
          ],
          "content": [
            {
              "html": "<p>Looks tasty!</p>",
              "value": "Looks tasty!"
            }
          ],
          "author": [
            {
              "type": [
                "h-card"
              ],
              "properties": {
                "photo": [
                  "https://cleverdevil.io/gfx/users/default-02.png"
                ],
                "name": [
                  "Camron"
                ],
                "url": [
                  "http://odat.xyz"
                ]
              },
              "value": "Camron"
            }
          ],
          "url": [
            "https://cleverdevil.io/2017/roasted-spatchcocked-chicken-with-potatoes-and-onions/annotations/62a73eee1aa07b818bb3a26c8c97631a"
          ]
        },
        "value": "https://cleverdevil.io/2017/roasted-spatchcocked-chicken-with-potatoes-and-onions/annotations/62a73eee1aa07b818bb3a26c8c97631a"
      }
    ],
    "post-kind": [
      "Recipe"
    ],
    "post-id": [
      "48111f4ff634207f255b5819e4b8dbfb"
    ]
  },
  "children": [
    {
      "type": [
        "h-recipe"
      ],
      "properties": {
        "name": [
          "Recipe: Roasted Spatchcocked Chicken with Potatoes and Onions"
        ],
        "photo": [
          "https://cleverdevil.io/file/5715812743bd77c753e1595a894129ff/thumb.jpg"
        ],
        "ingredient": [
          "1 roasting chicken, 4 lbs",
          "2.5 pounds sliced red or whole fingerling potatoes",
          "2 sweet onions, sliced",
          "1 stick of unsalted butter",
          "4 cloves garlic, mashed",
          "1 Tb dijon mustard",
          "1 ts minced fresh thyme, sage, and rosemary",
          "Black pepper",
          "Kosher salt",
          "Olive oil"
        ],
        "duration": [
          "60-80 minutes"
        ],
        "yield": [
          "4-6"
        ],
        "instructions": [
          {
            "html": "<p>This is an all-time favorite in the LaCour household. I believe that the original recipe came from America's Test Kitchen, years ago, but it may have been an Alton Brown creation. </p><ol><li>Pat chicken dry. Cut out backbone and keel bone to spatchcock the chicken.</li>\n<li>Make a compound butter with kosher salt, freshly ground black pepper, the minced herbs, garlic, and dijon mustard.</li>\n<li>With your fingers, loosen skin across breast and as far down drumsticks and thighs as you can, being careful not to tear the skin. Spoon butter under skin and work across as much of the chicken as possible.</li>\n<li>Apply additional salt and pepper to the top and bottom of the chicken.</li>\n<li>Toss the potatoes and onions with olive oil and salt and pepper. Add additional herbs and garlic, if you want.</li>\n<li>Line bottom of broiler pan with heavy-duty aluminium foil. Spread potato and onion mixture across pan evenly. Place grilling rack on top, and arrange the spatchcocked chicken on top, folding drumsticks inward so they cover part of the breast.</li>\n<li>Roast at 500 degrees for 20 minutes, turn pan around, roast for another 20 minutes or until internal temperature in breast is 150. Remove from oven and allow to cool for 10-15 minutes.</li>\n<li>Part out the chicken into portions, and serve with the potatoes and onions.</li>\n</ol><p>Enjoy!</p><p> </p>",
            "value": "This is an all-time favorite in the LaCour household. I believe that the original recipe came from America's Test Kitchen, years ago, but it may have been an Alton Brown creation. Pat chicken dry. Cut out backbone and keel bone to spatchcock the chicken. Make a compound butter with kosher salt, freshly ground black pepper, the minced herbs, garlic, and dijon mustard. With your fingers, loosen skin across breast and as far down drumsticks and thighs as you can, being careful not to tear the skin. Spoon butter under skin and work across as much of the chicken as possible. Apply additional salt and pepper to the top and bottom of the chicken. Toss the potatoes and onions with olive oil and salt and pepper. Add additional herbs and garlic, if you want. Line bottom of broiler pan with heavy-duty aluminium foil. Spread potato and onion mixture across pan evenly. Place grilling rack on top, and arrange the spatchcocked chicken on top, folding drumsticks inward so they cover part of the breast. Roast at 500 degrees for 20 minutes, turn pan around, roast for another 20 minutes or until internal temperature in breast is 150. Remove from oven and allow to cool for 10-15 minutes. Part out the chicken into portions, and serve with the potatoes and onions.\nEnjoy!"
          }
        ]
      }
    }
  ]
}