{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Climbing Franz Josef"
    ],
    "content": [
      {
        "html": "<p>On Thursday evening, 9 of us jumped into a large van and started driving east from ChristChurch.  We drove through the Southern Alps on narrow winding roads and across one lane bridges.  Several of the bridges are not only one lane, but are also occupied by railroad tracks, so that you have to yield to oncoming traffic and potentially to oncoming trains!  After several hours, we reached the center of the island at Arthur's Pass.</p><p>A few hours later we reached a small town just south of Greymouth on the western coast of the South Island.  We stopped here for dinner, and then got back on the road, heading south.  Around 11:30 PM, we arrived in Franz Josef, a small town next to the glacier of the same name.  Our group separated and stayed in two different hostels for the night.</p><p>After a good night's sleep, we had breakfast and walked to the nearby adventure center to begin our hike on Franz Josef glacier.  At the center, we were fitted with the World's Most Uncomfortable Boots ™ and some ice gripping attachments called <em>Talonz</em>.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/hike-start.jpg\"><img alt=\"hike-start.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/hike-start-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/glaciers-edge.jpg\"><img alt=\"glaciers-edge.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/glaciers-edge-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/me-on-glacier.jpg\"><img alt=\"me-on-glacier.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/me-on-glacier-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/me-atop-glacier.jpg\"><img alt=\"me-atop-glacier.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/me-atop-glacier-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/coming-down-glacier.jpg\"><img alt=\"coming-down-glacier.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/christchurch/coming-down-glacier-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/icy-glacier.jpg\"><img alt=\"icy-glacier.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/icy-glacier-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>The hike was absolutely breathtaking and took just about 4.5 hours from start to finish.  We were dropped at the foot of the glacier, and hiked across the bottom of a river bed toward the terminal face.  We were then instructed to strap on our <em>Talonz</em>, and were guided up the slippery face of the glacier.  After nearly two hours of hiking, we stopped for lunch at a rocky point on top of the glacier.  The hike was wonderful, but now I have blisters all over my feet from the terrible boots =)</p><p>After the hike was over, we hopped back into the van for a long drive back to ChristChurch.  This evening, a large group of us are going to attend a rugby match between the Wellington Hurricanes and the Canterbury Crusaders!  I will make sure to update you all tomorrow on the game!</p><p>I still miss you all, and hope things are going well back in the states!</p>",
        "value": "On Thursday evening, 9 of us jumped into a large van and started driving east from ChristChurch. We drove through the Southern Alps on narrow winding roads and across one lane bridges. Several of the bridges are not only one lane, but are also occupied by railroad tracks, so that you have to yield to oncoming traffic and potentially to oncoming trains! After several hours, we reached the center of the island at Arthur's Pass.\nA few hours later we reached a small town just south of Greymouth on the western coast of the South Island. We stopped here for dinner, and then got back on the road, heading south. Around 11:30 PM, we arrived in Franz Josef, a small town next to the glacier of the same name. Our group separated and stayed in two different hostels for the night.\nAfter a good night's sleep, we had breakfast and walked to the nearby adventure center to begin our hike on Franz Josef glacier. At the center, we were fitted with the World's Most Uncomfortable Boots ™ and some ice gripping attachments called Talonz. hike-start.jpg glaciers-edge.jpg me-on-glacier.jpg me-atop-glacier.jpg coming-down-glacier.jpg icy-glacier.jpg\nThe hike was absolutely breathtaking and took just about 4.5 hours from start to finish. We were dropped at the foot of the glacier, and hiked across the bottom of a river bed toward the terminal face. We were then instructed to strap on our Talonz, and were guided up the slippery face of the glacier. After nearly two hours of hiking, we stopped for lunch at a rocky point on top of the glacier. The hike was wonderful, but now I have blisters all over my feet from the terrible boots =)\nAfter the hike was over, we hopped back into the van for a long drive back to ChristChurch. This evening, a large group of us are going to attend a rugby match between the Wellington Hurricanes and the Canterbury Crusaders! I will make sure to update you all tomorrow on the game!\nI still miss you all, and hope things are going well back in the states!"
      }
    ],
    "url": [
      "/2003/climbing-franz-josef"
    ],
    "published": [
      "2003-02-22T12:29:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "360a6356450e89bffbc0831b8b29c124"
    ]
  }
}