{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Welcome to the bush."
    ],
    "content": [
      {
        "html": "<p>This morning, we departed Sydney for a brief stop in Canberra, city's tiny and much maligned capital city, before heading to Melbourne.  About three hours into our busride we began to notice a faint grey tint taking over the sky.  Within 45 minutes, the entire sky was nearly black, the sun peeking through like a bloodshot eye.  I was almost certain that the apocalypse had arrived.</p><p>It turns out that we were unlucky enough to arrive in Canberra as it was thrusted into the center of the worst brush fires to hit Australia in nearly 150 years.  Over 100 homes have been destroyed by fire today in this drought-stricken community, and evacuation centers are packed.  If I walk out of my hotel room, I can see and feel hot ashes falling from the sky, coating everything.  It is an amazing and terrifying sight that is disappointingly difficult to capture as a photo because it is so dark.</p><p>Now, I really feel like I am in the bush!</p>",
        "value": "This morning, we departed Sydney for a brief stop in Canberra, city's tiny and much maligned capital city, before heading to Melbourne. About three hours into our busride we began to notice a faint grey tint taking over the sky. Within 45 minutes, the entire sky was nearly black, the sun peeking through like a bloodshot eye. I was almost certain that the apocalypse had arrived.\nIt turns out that we were unlucky enough to arrive in Canberra as it was thrusted into the center of the worst brush fires to hit Australia in nearly 150 years. Over 100 homes have been destroyed by fire today in this drought-stricken community, and evacuation centers are packed. If I walk out of my hotel room, I can see and feel hot ashes falling from the sky, coating everything. It is an amazing and terrifying sight that is disappointingly difficult to capture as a photo because it is so dark.\nNow, I really feel like I am in the bush!"
      }
    ],
    "url": [
      "/2003/welcome-to-the-bush"
    ],
    "published": [
      "2003-01-18T07:54:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "f5bebc8ae57647432383def4016c7dbc"
    ]
  }
}