{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Culture Shock in Kyoto"
    ],
    "content": [
      {
        "html": "<p>Well, its been a long time since I have made an entry!  I have been keeping myself very busy here in Japan, and its been extremely difficult to find a time to do anything but eat, sleep, go to class, and tour around town!  I will do my best to summarize my time here so far...</p><p>We arrived at our hotel late in the evening, after a long flight and a short bus ride.  The hotel seems pretty nice from the look of the lobby, but the rooms are ridiculously small, and the bathrooms are even <em>smaller</em>.  In fact, everything is smaller here in Japan, right down to the people.  The bathroom looks like a slightly extended version of an airplane bathroom — and I am not kidding, this room is unbelievably tiny.  The breakfast in the hotel is wonderful  though, and is a combination of western and Japanese breakfast foods, including salmon, sticky rice, traditional miso soup, and tofu.</p><p>The program purchased us meal coupons with a value of ¥1000 apiece, and we can use these to eat at one of four restaurants.  There is a traditional Japanese sushi place, a Chinese restaurant, a tempura and friend foods place, and a hearty foods (i.e. steaks, fried fish, etc.) place.  The Chinese restaurant is by far the best, and they have a great noodle dish with egg, crab meat, and carrots with some spicy fried chicken, and fried rice.  I tried out the sushi place, and ordered a dish with nothing but raw fish, and I wasn't really all that impressed with it — cooked fish is so wonderful, I can't really think of any reason to eat it cold and raw!</p><p>One interesting thing that I did this week was visit the <em>Kyoto Hanatouro</em> celebration of lights at a temple in the heart of the city.  Once a year, to celebrate the lighting of the lanterns at the temple, a festival celebration is held for a week during the evenings.  There was live traditional Japanese music, Geishas, art exhibits, and a huge stream filled with bamboo lamps.  It was too dark to get any pictures, and its a real shame that I cannot show you this!  It was absolutely beautiful!</p><p>We also visited a second temple during the day called <em>Higashi Honganji</em>, which is right down the street from our hotel.  This temple is the Mausoleum of Shinran Shonin (1173-1262), the founder of Shin Buddhism, and also the mother temple of the Shinshu of Otani-ha, one of the largest Buddhist denominations in Japan.  The temple is absolutely stunning, and is one of the largest wooden structures in Japan.  We walked around for a few hours, and I actually did manage to take a few pictures here.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/kyoto/kyoto-station.jpg\"><img alt=\"kyoto-station.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/kyoto-station-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/me-at-temple.jpg\"><img alt=\"me-at-temple.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/me-at-temple-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/lamp-inside-temple.jpg\"><img alt=\"lamp-inside-temple.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/lamp-inside-temple-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/kyoto/temple-dragon.jpg\"><img alt=\"temple-dragon.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/temple-dragon-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/outside-temple.jpg\"><img alt=\"outside-temple.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/kyoto/outside-temple-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/at-temple.jpg\"><img alt=\"at-temple.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/at-temple-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Probably the most fun thing that I have done in Japan thus far is karaoke.  A group of 9 of us found a tiny hole in the wall karaoke bar overlooking a river.  We rented the entire place out for 2½ hours.  We were able to eat all the snacks  (crazy japanese snack food) and drink all the drinks (soda, beer, sake, etc.) that we could for the entire time.  We had a complete blast singing, since we all knew each other and didn't mind making ourselves look too silly.  It reminded me a lot of the good old Thad &amp; Joe's back in the ATL!</p><p>A few days ago, our class took a field trip to <em>Kyoto Movieland</em>, which is probably the single worst theme park in all of history!  They make Samurai and Kung-Fu B-Movies at this park, and you can watch them film, take pictures with the Samurai and Geisha, and waste your money on silly plastic swords and chopsticks.  One of the only redeeming parts about this day was the ninja show at the park, which was entirely in Japanese, carried out by terrible actors, and complete with all the insane music and plot twists that you find in Japanese Animation.  I had a good time even though this was a silly park, just because it was so bad.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/kyoto/movieland.jpg\"><img alt=\"movieland.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/movieland-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/me-and-samurai.jpg\"><img alt=\"me-and-samurai.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/me-and-samurai-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr><tr><td>\n<a href=\"http://www.skinnee.net/images/kyoto/me-and-geishas.jpg\"><img alt=\"me-and-geishas.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/me-and-geishas-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/kyoto/movieland-street.jpg\"><img alt=\"movieland-street.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/kyoto/movieland-street-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Another cool thing that we have done in Kyoto is visit all of the shops and markets that we can find.  I haven't really been able to purchase very much, but its been really amazingly cool to look at all of the interesting things that you can buy here.  Probably the coolest place is a massive electronics store on the 6th floor of Kyoto Tower building.  They have all of the electronics that will be coming out in the U.S. in 2 years, including digital cameras the size of credit cards, tiny computers, cool MP3 players, and much much more.  I walked around this place for a few solid hours playing with all of the cool gadgets!</p><p>So far, I am having an excellent time here in Japan, and the culture shock hasn't actually been too bad!  I have had a wonderful time trying to communicate with all of the people here.  Its been fairly difficult to get even the most common things done, but with a phrase book, a pen, and a lot of bowing, its possible to get things done!  Tomorrow morning I am taking a bullet train to Osaka for a day to watch some Sumo Wrestling and walk around the town.  Then on Sunday we are packing our bags and taking the train to Hiroshima!  I will try and be better about my blogs, I still love you and miss you all!</p>",
        "value": "Well, its been a long time since I have made an entry! I have been keeping myself very busy here in Japan, and its been extremely difficult to find a time to do anything but eat, sleep, go to class, and tour around town! I will do my best to summarize my time here so far...\nWe arrived at our hotel late in the evening, after a long flight and a short bus ride. The hotel seems pretty nice from the look of the lobby, but the rooms are ridiculously small, and the bathrooms are even smaller. In fact, everything is smaller here in Japan, right down to the people. The bathroom looks like a slightly extended version of an airplane bathroom — and I am not kidding, this room is unbelievably tiny. The breakfast in the hotel is wonderful though, and is a combination of western and Japanese breakfast foods, including salmon, sticky rice, traditional miso soup, and tofu.\nThe program purchased us meal coupons with a value of ¥1000 apiece, and we can use these to eat at one of four restaurants. There is a traditional Japanese sushi place, a Chinese restaurant, a tempura and friend foods place, and a hearty foods (i.e. steaks, fried fish, etc.) place. The Chinese restaurant is by far the best, and they have a great noodle dish with egg, crab meat, and carrots with some spicy fried chicken, and fried rice. I tried out the sushi place, and ordered a dish with nothing but raw fish, and I wasn't really all that impressed with it — cooked fish is so wonderful, I can't really think of any reason to eat it cold and raw!\nOne interesting thing that I did this week was visit the Kyoto Hanatouro celebration of lights at a temple in the heart of the city. Once a year, to celebrate the lighting of the lanterns at the temple, a festival celebration is held for a week during the evenings. There was live traditional Japanese music, Geishas, art exhibits, and a huge stream filled with bamboo lamps. It was too dark to get any pictures, and its a real shame that I cannot show you this! It was absolutely beautiful!\nWe also visited a second temple during the day called Higashi Honganji, which is right down the street from our hotel. This temple is the Mausoleum of Shinran Shonin (1173-1262), the founder of Shin Buddhism, and also the mother temple of the Shinshu of Otani-ha, one of the largest Buddhist denominations in Japan. The temple is absolutely stunning, and is one of the largest wooden structures in Japan. We walked around for a few hours, and I actually did manage to take a few pictures here. kyoto-station.jpg me-at-temple.jpg lamp-inside-temple.jpg temple-dragon.jpg outside-temple.jpg at-temple.jpg\nProbably the most fun thing that I have done in Japan thus far is karaoke. A group of 9 of us found a tiny hole in the wall karaoke bar overlooking a river. We rented the entire place out for 2½ hours. We were able to eat all the snacks (crazy japanese snack food) and drink all the drinks (soda, beer, sake, etc.) that we could for the entire time. We had a complete blast singing, since we all knew each other and didn't mind making ourselves look too silly. It reminded me a lot of the good old Thad & Joe's back in the ATL!\nA few days ago, our class took a field trip to Kyoto Movieland, which is probably the single worst theme park in all of history! They make Samurai and Kung-Fu B-Movies at this park, and you can watch them film, take pictures with the Samurai and Geisha, and waste your money on silly plastic swords and chopsticks. One of the only redeeming parts about this day was the ninja show at the park, which was entirely in Japanese, carried out by terrible actors, and complete with all the insane music and plot twists that you find in Japanese Animation. I had a good time even though this was a silly park, just because it was so bad. movieland.jpg me-and-samurai.jpg me-and-geishas.jpg movieland-street.jpg\nAnother cool thing that we have done in Kyoto is visit all of the shops and markets that we can find. I haven't really been able to purchase very much, but its been really amazingly cool to look at all of the interesting things that you can buy here. Probably the coolest place is a massive electronics store on the 6th floor of Kyoto Tower building. They have all of the electronics that will be coming out in the U.S. in 2 years, including digital cameras the size of credit cards, tiny computers, cool MP3 players, and much much more. I walked around this place for a few solid hours playing with all of the cool gadgets!\nSo far, I am having an excellent time here in Japan, and the culture shock hasn't actually been too bad! I have had a wonderful time trying to communicate with all of the people here. Its been fairly difficult to get even the most common things done, but with a phrase book, a pen, and a lot of bowing, its possible to get things done! Tomorrow morning I am taking a bullet train to Osaka for a day to watch some Sumo Wrestling and walk around the town. Then on Sunday we are packing our bags and taking the train to Hiroshima! I will try and be better about my blogs, I still love you and miss you all!"
      }
    ],
    "url": [
      "/2003/culture-shock-in-kyoto"
    ],
    "published": [
      "2003-03-14T14:11:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "1588c5a9b39c6966bbc81a97646b77cb"
    ]
  }
}