{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Gadget addict: new iPod"
    ],
    "content": [
      {
        "html": "<p>Back when the original <a href=\"http://www.apple.com/ipod\">Apple iPod</a> came out, I was an early adopter, and elected to purchase a 10 <span class=\"caps\">GB</span> iPod.  Soon after, it became a part of my everyday routine.  I was enamored by its sleek design, ease of use, and the sheer mass of music that I could carry around in my pocket.  It synched beautifully with my PowerBook, and allowed me to enjoy music in my car.  I loved my iPod.</p><p>A few weeks ago, Apple released a brand new <a href=\"http://www.apple.com/music\">music store</a> that integrates directly with iTunes 4.0.  Wow!  Yet another wonderful use for  my iPod.  I tried out the music store, and I was impressed by how convenient it was.  Of course, I read a lot of bickering about <span class=\"caps\">DRM</span> restrictions, audio quality, and lack of selection, but this really didn’t phase me.  All I know is that I can legally download songs from a fairly wide range of artists, carry them around with me wherever I go.  Simply fantastic.</p><p>Along with the new music store, Apple updated its iPod line.  The newest iPod is thinner, can hold more music, comes with a cool dock, and is entirely controlled via touch-sensitive buttons and scrollers.  Last night I sold my original iPod for a decent amount and promptly went out and purchased a brand new 30 <span class=\"caps\">GB</span> iPod.  My experience thus-far has been excellent.</p><p>Here’s a rundown of the new iPod when compared to my old one:</p><p><strong>Pros</strong></p><ol><li>Even more attractive than the original</li>\n<li>Customizable main menu</li>\n<li>The dock is <em>fantastic</em></li>\n<li>Lighter and thinner</li>\n<li>The screen is brighter and easier to read</li>\n<li>The backlight is impressive</li>\n<li>Touch-sensitive scroll wheel is very responsive</li>\n<li>It holds three times the music</li>\n<li>The notes feature is incredible when coupled with AppleScript</li>\n<li>New games</li>\n</ol><p><strong>Cons</strong></p><ol><li>Battery life is about 2 hours shorter</li>\n<li>Buttons are a bit <em>too</em> touch sensitive</li>\n<li>I have to buy a new car charger</li>\n</ol><p>Overall, I am pleased with my purchase.  I think the new iPod is definitely an improvement over the original, and is sure to provide me with countless hours of musical love.</p>",
        "value": "Back when the original Apple iPod came out, I was an early adopter, and elected to purchase a 10 GB iPod. Soon after, it became a part of my everyday routine. I was enamored by its sleek design, ease of use, and the sheer mass of music that I could carry around in my pocket. It synched beautifully with my PowerBook, and allowed me to enjoy music in my car. I loved my iPod.\nA few weeks ago, Apple released a brand new music store that integrates directly with iTunes 4.0. Wow! Yet another wonderful use for my iPod. I tried out the music store, and I was impressed by how convenient it was. Of course, I read a lot of bickering about DRM restrictions, audio quality, and lack of selection, but this really didn’t phase me. All I know is that I can legally download songs from a fairly wide range of artists, carry them around with me wherever I go. Simply fantastic.\nAlong with the new music store, Apple updated its iPod line. The newest iPod is thinner, can hold more music, comes with a cool dock, and is entirely controlled via touch-sensitive buttons and scrollers. Last night I sold my original iPod for a decent amount and promptly went out and purchased a brand new 30 GB iPod. My experience thus-far has been excellent.\nHere’s a rundown of the new iPod when compared to my old one:\nProsEven more attractive than the original Customizable main menu The dock is fantastic Lighter and thinner The screen is brighter and easier to read The backlight is impressive Touch-sensitive scroll wheel is very responsive It holds three times the music The notes feature is incredible when coupled with AppleScript New games\nConsBattery life is about 2 hours shorter Buttons are a bit too touch sensitive I have to buy a new car charger\nOverall, I am pleased with my purchase. I think the new iPod is definitely an improvement over the original, and is sure to provide me with countless hours of musical love."
      }
    ],
    "url": [
      "/2003/gadget-addict-new-ipod"
    ],
    "published": [
      "2003-05-14T13:54:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "dd04f8d8e2078b7bc9129e2f58506544"
    ]
  }
}