{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Beautiful Brisbane!"
    ],
    "content": [
      {
        "html": "<p>I arrived in Brisbane safely after the longest series of flights that I have ever experienced.  After not sleeping for 30 straight hours, I finally managed to sleep on the last flight by taking some melatonin.  It was all worth it — Brisbane is an <em>amazing</em> city.</p><p>Our bus arrived at Union College here in Brisbane at approximately 7:00 AM and we were given keys to our dormitory rooms, which are roughly equivalent to combining the quality of Georgia Tech Freshman dorms with the size of a typical GT on campus apartment.  Not too bad.  Once I arrived I promptly switched out of my boring Architecture class into the much more interesting and fun Biology class.  This would pay off bigtime later =)</p><p>I spent the first day wandering around downtown Brisbane after taking a bus.  This is probably one of the nicest cities I have ever been in.  It has a bustling, but open downtown center with excellent public transportation in the form of busses and a really nice ferry service on the river called the CityCat.  We walked through the city and happened upon city hall, the downtown square, and the absolutely beautiful Brisbane Botanical Gardens.  The Botanical Gardens are a gorgeous park located just adjacent to the center of the city in the spirit of New York's Central Park, only much much cleaner and nicer.  The park is spotless, with excellent signage to help you learn about what you are seeing, picnic areas, a view of the river, and an awesome biking and running path.  I just cannot say enough about this city!</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/brisbane/botanicalgarden.jpg\"><img alt=\"botanicalgarden.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/botanicalgarden-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/cityhall.jpg\"><img alt=\"cityhall.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/brisbane/cityhall-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/sculpture.jpg\"><img alt=\"sculpture.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/sculpture-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>The next day, my Biology class took a day trip (which is considered a Georgia Tech lab) out to see Mount Tamborine.  Here we hiked a two mile trail in a sub-tropical rain forest populated with gorgeous Eucalyptus, Buttressed, and Strangler Fig trees.  The rain forest is covered with an amazingly dense canopy, which leaves a nice open, cool, and humid undercover to hike in.  The trees are surprisingly far apart, and there are amazingly large boulders scattered through the undercover.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/brisbane/hiking.jpg\"><img alt=\"hiking.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/hiking-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/meonarock.jpg\"><img alt=\"meonarock.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/brisbane/meonarock-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/treetops.jpg\"><img alt=\"treetops.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/treetops-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Following the field trip to the rain forest, we travelled on the bus down the to the Gold Coast, which is home to one of Australia's most famous beaches called Surfer's Paradise.  This was the single best beach I have ever been on!  The waves were above 6 or 7 feet, making for very exciting body surfing, and the sand was clean and fluffy.  After taking the bus home, we visited the casino in downtown Brisbane for $2.00 AUD beers (about a dollar each) and a little gambling (which of course I didn't participate in... waste of money).</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/brisbane/surfersparadise.jpg\"><img alt=\"surfersparadise.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/surfersparadise-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/dangerdudes.jpg\"><img alt=\"dangerdudes.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/dangerdudes-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Today we had our first day of classes, which was boring, but tolerable.  We had class from 9 AM until around 11:45, with a comfortable break in the middle.  After lunch, a group of us decided to take the bus to the Pine Bluff Koala Preserve to see the Kangaroos, Koalas, Dingoes, Wombats, etc. up close.  I was able to wander into a open field of over 50 kangaroos ranging in age from babies to full grown adults, and we could pet them, feed them out of our hands, and watch them bounce around.  Then I went over to the Koala park and held a Koala bear in my arms for a few minutes (pictures cost 15 bucks, so I opted out of that).</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/brisbane/koalasleeping.jpg\"><img alt=\"koalasleeping.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/koalasleeping-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/mewithroo.jpg\"><img alt=\"mewithroo.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/mewithroo-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr><tr><td>\n<a href=\"http://www.skinnee.net/images/brisbane/mewithroos.jpg\"><img alt=\"mewithroos.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/mewithroos-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/sleepingdingo.jpg\"><img alt=\"sleepingdingo.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/sleepingdingo-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Well, that about sums things up for what I have done so far!  I will try to update this more regularly from now on, but its tough since we are kept so busy.  Tomorrow we are taking another field trip and heading to a second beach, and Saturday I have signed up to visit Moreton Bay on an all day trip complete with sailing, scuba diving with sunken ships, sand surfing down the world's largest sand dunes (over 200 foot high), and speed boat tubing.  The full day cost me around $50 USD... wow =)  I will make sure to update tomorrow, and hopefully I will finally be able to make some phone calls tomorrow.</p><p><em>G'day, and no worries!</em></p>",
        "value": "I arrived in Brisbane safely after the longest series of flights that I have ever experienced. After not sleeping for 30 straight hours, I finally managed to sleep on the last flight by taking some melatonin. It was all worth it — Brisbane is an amazing city.\nOur bus arrived at Union College here in Brisbane at approximately 7:00 AM and we were given keys to our dormitory rooms, which are roughly equivalent to combining the quality of Georgia Tech Freshman dorms with the size of a typical GT on campus apartment. Not too bad. Once I arrived I promptly switched out of my boring Architecture class into the much more interesting and fun Biology class. This would pay off bigtime later =)\nI spent the first day wandering around downtown Brisbane after taking a bus. This is probably one of the nicest cities I have ever been in. It has a bustling, but open downtown center with excellent public transportation in the form of busses and a really nice ferry service on the river called the CityCat. We walked through the city and happened upon city hall, the downtown square, and the absolutely beautiful Brisbane Botanical Gardens. The Botanical Gardens are a gorgeous park located just adjacent to the center of the city in the spirit of New York's Central Park, only much much cleaner and nicer. The park is spotless, with excellent signage to help you learn about what you are seeing, picnic areas, a view of the river, and an awesome biking and running path. I just cannot say enough about this city! botanicalgarden.jpg cityhall.jpg sculpture.jpg\nThe next day, my Biology class took a day trip (which is considered a Georgia Tech lab) out to see Mount Tamborine. Here we hiked a two mile trail in a sub-tropical rain forest populated with gorgeous Eucalyptus, Buttressed, and Strangler Fig trees. The rain forest is covered with an amazingly dense canopy, which leaves a nice open, cool, and humid undercover to hike in. The trees are surprisingly far apart, and there are amazingly large boulders scattered through the undercover. hiking.jpg meonarock.jpg treetops.jpg\nFollowing the field trip to the rain forest, we travelled on the bus down the to the Gold Coast, which is home to one of Australia's most famous beaches called Surfer's Paradise. This was the single best beach I have ever been on! The waves were above 6 or 7 feet, making for very exciting body surfing, and the sand was clean and fluffy. After taking the bus home, we visited the casino in downtown Brisbane for $2.00 AUD beers (about a dollar each) and a little gambling (which of course I didn't participate in... waste of money). surfersparadise.jpg dangerdudes.jpg\nToday we had our first day of classes, which was boring, but tolerable. We had class from 9 AM until around 11:45, with a comfortable break in the middle. After lunch, a group of us decided to take the bus to the Pine Bluff Koala Preserve to see the Kangaroos, Koalas, Dingoes, Wombats, etc. up close. I was able to wander into a open field of over 50 kangaroos ranging in age from babies to full grown adults, and we could pet them, feed them out of our hands, and watch them bounce around. Then I went over to the Koala park and held a Koala bear in my arms for a few minutes (pictures cost 15 bucks, so I opted out of that). koalasleeping.jpg mewithroo.jpg mewithroos.jpg sleepingdingo.jpg\nWell, that about sums things up for what I have done so far! I will try to update this more regularly from now on, but its tough since we are kept so busy. Tomorrow we are taking another field trip and heading to a second beach, and Saturday I have signed up to visit Moreton Bay on an all day trip complete with sailing, scuba diving with sunken ships, sand surfing down the world's largest sand dunes (over 200 foot high), and speed boat tubing. The full day cost me around $50 USD... wow =) I will make sure to update tomorrow, and hopefully I will finally be able to make some phone calls tomorrow.\nG'day, and no worries!"
      }
    ],
    "url": [
      "/2003/beautiful-brisbane"
    ],
    "published": [
      "2003-01-08T04:01:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "f9a5996e6848c7fcfd6ec489ce9cf83b"
    ]
  }
}