{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Lawn bowling and the tram"
    ],
    "content": [
      {
        "html": "<p>Yesterday, a group of 10 of us decided that we wanted to learn a bit about Lawn Bowling, which is a very old sport mostly played by very old people.  We had the hotel call the Riccarton Bowling Club, and let them know that we would be dropping by.  After a short walk, we arrived at the club around 2:30 PM.</p><p>Upon arrival, we were greeted by several nice old men who showed us around the club, and explained the basics of the game to us.  They were also kind enough to lend us some bowls so that we could actually play a few games.  The game is fairly simple in theory, but very difficult in practice.  The field of play is a very finely kept grass surface, similar to that of a golf green.  The balls (or <em>\"bowls\"</em> as they are called) are roughly the size of a large grapefruit and are similarly shaped.  One side of each bowl is marked with a small insignia as the <em>\"biased\"</em> side of the bowl.  When rolled, the bowl will drift in the direction of the bias, until it eventually falls over.</p><p>The idea of the game is to try and get as many bowls as possible close to a small white ball that is rolled to the end of the field, called the <em>\"jack\"</em>.  You can either face the bias of the bowl inwards and roll it to the right of the jack, which is called a <em>forehand</em> bowl.  Or you can face the bias outwards and toward your palm, and roll it to the left of the jack, which is called a <em>backhand</em> bowl.  The bias of the bowl will slowly carry it back towards the jack, and with practice, you can cause the bowl to fall directly in front or behind the jack.</p><p>As I stated, the game is quite difficult in practice, and the men at the bowling club had a few laughs at our expense as we tried our best to figure out the game.  After an hour or so of practice, a few of us were able to make consistently decent shots.  We played for a few hours, and probably gave this group of old men more excitement than they have seen in years =)  We might be heading back there next week to play in a tourney just for fun.  The club reminded me a lot of what a fraternity would be like if its membership was composed entirely of 80 year old men.  When we walked inside, there were tons of tables full of these really ancient guys drinking <em>tons</em> of beer, which they have lots of on tap, and arguing about the finer points of bowls and generally having a good time.  It was pretty funny =)  I took my camera, but forgot to charge the battery, so I will have to wait to post pictures of me bowling until I get the chance to copy some other people's pictures....</p><p>Today, a group of us decided to ride the historic ChristChurch tram.  The tramway is composed of several beautifully restored trams from the latter part of the last century.  Trams, whether horse drawn, steam powered, or electric, have been a part of ChristChurch's culture since early in its history.  In 1954, the trams disappeared from the streets of ChristChurch because of lack of interest and funding.  But, in 1995 the people of ChristChurch decided to make a return to the roots of their history by restoring and re-installing the familiar green-and-cream trams and returning the trams to service.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/tram-in-town.jpg\"><img alt=\"tram-in-town.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/tram-in-town-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/tram-inside.jpg\"><img alt=\"tram-inside.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/tram-inside-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/outside-tram-two.jpg\"><img alt=\"outside-tram-two.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/outside-tram-two-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/out-around-town.jpg\"><img alt=\"out-around-town.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/out-around-town-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/oversized-chess.jpg\"><img alt=\"oversized-chess.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/oversized-chess-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Travelling by tram is a lot of fun, and is more than simply a method of transport.  Trams are not really the <em>fastest</em> way to get around town, but they are highly refined and beautiful inside, and act as more of an event or experience than a simple way to get from place to place.  The tramway even offers a specific car which doubles as a high-class restaurant.  Those who desire an evening of fine food, drink, and socializing in the unique and luxurious interior of the tram can place reservations for any night of the week.</p><p>While I am not enjoying ChristChurch nearly as much as many of the other places I have visited, I am starting to warm up to the place a bit =).  Tomorrow a big group of us are driving down to Queenstown (the adventure capital of New Zealand) to go hang-gliding and to ride the land-luge.  A bunch of people are also skydiving or bungee jumping, but I decided against both as they are expensive for a short amount of time.  After Queenstown we are travelling to Milford Sound, which is supposed to be one of the most beautiful parts of all New Zealand.  There, we will be taking a day-cruise complete with lunch and several scenic stops.  We will return on Sunday afternoon with a long drive across the island through the Southerm Alps.</p>",
        "value": "Yesterday, a group of 10 of us decided that we wanted to learn a bit about Lawn Bowling, which is a very old sport mostly played by very old people. We had the hotel call the Riccarton Bowling Club, and let them know that we would be dropping by. After a short walk, we arrived at the club around 2:30 PM.\nUpon arrival, we were greeted by several nice old men who showed us around the club, and explained the basics of the game to us. They were also kind enough to lend us some bowls so that we could actually play a few games. The game is fairly simple in theory, but very difficult in practice. The field of play is a very finely kept grass surface, similar to that of a golf green. The balls (or \"bowls\" as they are called) are roughly the size of a large grapefruit and are similarly shaped. One side of each bowl is marked with a small insignia as the \"biased\" side of the bowl. When rolled, the bowl will drift in the direction of the bias, until it eventually falls over.\nThe idea of the game is to try and get as many bowls as possible close to a small white ball that is rolled to the end of the field, called the \"jack\". You can either face the bias of the bowl inwards and roll it to the right of the jack, which is called a forehand bowl. Or you can face the bias outwards and toward your palm, and roll it to the left of the jack, which is called a backhand bowl. The bias of the bowl will slowly carry it back towards the jack, and with practice, you can cause the bowl to fall directly in front or behind the jack.\nAs I stated, the game is quite difficult in practice, and the men at the bowling club had a few laughs at our expense as we tried our best to figure out the game. After an hour or so of practice, a few of us were able to make consistently decent shots. We played for a few hours, and probably gave this group of old men more excitement than they have seen in years =) We might be heading back there next week to play in a tourney just for fun. The club reminded me a lot of what a fraternity would be like if its membership was composed entirely of 80 year old men. When we walked inside, there were tons of tables full of these really ancient guys drinking tons of beer, which they have lots of on tap, and arguing about the finer points of bowls and generally having a good time. It was pretty funny =) I took my camera, but forgot to charge the battery, so I will have to wait to post pictures of me bowling until I get the chance to copy some other people's pictures....\nToday, a group of us decided to ride the historic ChristChurch tram. The tramway is composed of several beautifully restored trams from the latter part of the last century. Trams, whether horse drawn, steam powered, or electric, have been a part of ChristChurch's culture since early in its history. In 1954, the trams disappeared from the streets of ChristChurch because of lack of interest and funding. But, in 1995 the people of ChristChurch decided to make a return to the roots of their history by restoring and re-installing the familiar green-and-cream trams and returning the trams to service. tram-in-town.jpg tram-inside.jpg outside-tram-two.jpg out-around-town.jpg oversized-chess.jpg\nTravelling by tram is a lot of fun, and is more than simply a method of transport. Trams are not really the fastest way to get around town, but they are highly refined and beautiful inside, and act as more of an event or experience than a simple way to get from place to place. The tramway even offers a specific car which doubles as a high-class restaurant. Those who desire an evening of fine food, drink, and socializing in the unique and luxurious interior of the tram can place reservations for any night of the week.\nWhile I am not enjoying ChristChurch nearly as much as many of the other places I have visited, I am starting to warm up to the place a bit =). Tomorrow a big group of us are driving down to Queenstown (the adventure capital of New Zealand) to go hang-gliding and to ride the land-luge. A bunch of people are also skydiving or bungee jumping, but I decided against both as they are expensive for a short amount of time. After Queenstown we are travelling to Milford Sound, which is supposed to be one of the most beautiful parts of all New Zealand. There, we will be taking a day-cruise complete with lunch and several scenic stops. We will return on Sunday afternoon with a long drive across the island through the Southerm Alps."
      }
    ],
    "url": [
      "/2003/lawn-bowling-and-the-tram"
    ],
    "published": [
      "2003-02-26T20:52:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "e0e047b4c4fdce9aba9d3f774150e2b8"
    ]
  }
}