{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "The great city of Tokyo"
    ],
    "content": [
      {
        "html": "<p>This weekend, I went with a large group of friends for a three day, two night trip to the great city of Tokyo.  We left on Friday on the 11:30 <span class=\"caps\">AM </span>Shinsaken bullet train, and stopped in Kyoto for lunch.  When I stayed in Kyoto earlier in the trip, I never was able to make it to the top of the station to have a look at the tower, so we used our 1 hour layover to take a short trip to the top of the station.  The station has a series of many open-air escalators under a beautiful glass overhang.  We took some pictures and then boarded the train again, bound for Tokyo.</p><p></p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/tokyo/kyoto-tower-reflection.jpg\"><img alt=\"kyoto-tower-reflection.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/tokyo/kyoto-tower-reflection-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/tokyo/kyoto-station.jpg\"><img alt=\"kyoto-station.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/tokyo/kyoto-station-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/tokyo/kyoto-tower.jpg\"><img alt=\"kyoto-tower.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/tokyo/kyoto-tower-thumb.jpg\" width=\"90\"/></a>\n</td>\n</tr></tbody></table><p>We arrived in Tokyo around 5:30 <span class=\"caps\">PM,</span> and took a short local train trip to our hotel, which was located across the street from Shinagawa Station, in the heart of Tokyo.  We stayed in the Shinagawa Prince Hotel, which is a pretty nice hotel, and we managed to cram a bunch of people into the rooms to make it affordable.  That night, we walked around a bit, and eventually ate dinner at <span class=\"caps\">T.G.I. </span>Friday’s (hooray for American food!) before calling it a night.</p><p>The next morning, we started our day with a trip to Akihabara, home of Tokyo’s <em>Electric Town</em>, which is like the Mecca of discount electronics.  There are bright lights, shouting merchants, and crazy gadgets as far as the eye can see.  Following this, we took another train to Ginza to see the Sony Building.  Unfortunately, the Sony Building was largely under renovation, so we did not get to see any more gadgets — I nearly cried.  After recovering from the Sony disappointment, we ate lunch in Ginza.</p><p>Feeling refreshed, we took yet another train to Ebisu, a really nice district of Tokyo, and home to Sapporo breweries.  Here, we visited the Yebisu Beer Museum, and enjoyed sampling some of Sapporo’s fine selection of liquid bread, which I must say that I found very tasty.</p><p></p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/tokyo/ebisu-intersection.jpg\"><img alt=\"ebisu-intersection.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/tokyo/ebisu-intersection-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/tokyo/jon-loves-beer.jpg\"><img alt=\"jon-loves-beer.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/tokyo/jon-loves-beer-thumb.jpg\" width=\"110\"/></a>\n</td>\n</tr></tbody></table><p>Next, we made even more use of our Japan Rail passes, and took the train to Shibuya, which probably fit the stereotypical image of Tokyo better than any other place that I visited.  We bursted out of the station into a mass of people, video screens, tall buildings, and anti-war chanting.  Shibuya is a trendy spot to hang out for young people, and they were out in full force protesting the war in Iraq.  After Shibuya, we visited a nice shopping district not too far away, and then went to dinner at the Outback Steakhouse, which produced the first normal and acceptable hamburger that I have eaten since I left the States!</p><p></p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/tokyo/shi-boo-yah-scene.jpg\"><img alt=\"shi-boo-yah-scene.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/tokyo/shi-boo-yah-scene-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/tokyo/shi-boo-yah-protestors.jpg\"><img alt=\"shi-boo-yah-protestors.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/tokyo/shi-boo-yah-protestors-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/tokyo/naughty-protestor.jpg\"><img alt=\"naughty-protestor.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/tokyo/naughty-protestor-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/tokyo/shi-boo-yah-scene-two.jpg\"><img alt=\"shi-boo-yah-scene-two.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/tokyo/shi-boo-yah-scene-two-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>After dinner, we headed out to Rotangi, a very sketchy bar and club district.  This place was pretty nuts, and is built on some strange system of bartering and negotation over the price of drinks… we finally settled down somewhere, had a few drinks, and went back to the hotel feeling exhausted.</p><p>This morning, we started our day by visiting the Imperial Palance, which was extremely anti-climactic.  The gardens are unattractive, and the palace itself is so heavily guarded that you can’t see hardly any of it.  We then visited Shinjuku, which is supposed to be like the Times Square of Tokyo.  In Shinjuku, we climbed to the top of a massive twin tower building to see the entire city.  The view was amazing, and it became quickly clear that Tokyo is a very polluted city — the haze rivals Atlanta!  Then, we went back to Electric Town for one last look at all the crazy electronics.</p><p></p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/tokyo/me-makin-palace-look-cheap.jpg\"><img alt=\"me-makin-palace-look-cheap.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/tokyo/me-makin-palace-look-cheap-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/tokyo/shinjuku-buildings.jpg\"><img alt=\"shinjuku-buildings.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/tokyo/shinjuku-buildings-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/tokyo/shinjuku-extreme-me.jpg\"><img alt=\"shinjuku-extreme-me.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/tokyo/shinjuku-extreme-me-thumb.jpg\" width=\"90\"/></a>\n</td>\n</tr></tbody></table><p>I had a great time in Tokyo this weekend, and I am now on the last leg of my 5 hour train trip to Kanazawa.  My impressions of Japan have most definitely been affected by my time in Tokyo.  I always thought that the United States of America was the most consumer oriented country in the world — this is simply not true.  If there is one thing that I have learned from Tokyo, its that the Japanese shop like its their job.  Honestly, these people have an unsatiable lust for consumption that is unmatched in the rest of the world… its simply amazing.  If I ever come back to Tokyo, I shall have to make sure that I have more money next time, so that I can do my part =)</p><p>Well, our train is pulling into the station!  I will write about Kanazawa <span class=\"caps\">ASAP</span>!  Love you and miss you all!</p>",
        "value": "This weekend, I went with a large group of friends for a three day, two night trip to the great city of Tokyo. We left on Friday on the 11:30 AM Shinsaken bullet train, and stopped in Kyoto for lunch. When I stayed in Kyoto earlier in the trip, I never was able to make it to the top of the station to have a look at the tower, so we used our 1 hour layover to take a short trip to the top of the station. The station has a series of many open-air escalators under a beautiful glass overhang. We took some pictures and then boarded the train again, bound for Tokyo.\n kyoto-tower-reflection.jpg kyoto-station.jpg kyoto-tower.jpg\nWe arrived in Tokyo around 5:30 PM, and took a short local train trip to our hotel, which was located across the street from Shinagawa Station, in the heart of Tokyo. We stayed in the Shinagawa Prince Hotel, which is a pretty nice hotel, and we managed to cram a bunch of people into the rooms to make it affordable. That night, we walked around a bit, and eventually ate dinner at T.G.I. Friday’s (hooray for American food!) before calling it a night.\nThe next morning, we started our day with a trip to Akihabara, home of Tokyo’s Electric Town, which is like the Mecca of discount electronics. There are bright lights, shouting merchants, and crazy gadgets as far as the eye can see. Following this, we took another train to Ginza to see the Sony Building. Unfortunately, the Sony Building was largely under renovation, so we did not get to see any more gadgets — I nearly cried. After recovering from the Sony disappointment, we ate lunch in Ginza.\nFeeling refreshed, we took yet another train to Ebisu, a really nice district of Tokyo, and home to Sapporo breweries. Here, we visited the Yebisu Beer Museum, and enjoyed sampling some of Sapporo’s fine selection of liquid bread, which I must say that I found very tasty.\n ebisu-intersection.jpg jon-loves-beer.jpg\nNext, we made even more use of our Japan Rail passes, and took the train to Shibuya, which probably fit the stereotypical image of Tokyo better than any other place that I visited. We bursted out of the station into a mass of people, video screens, tall buildings, and anti-war chanting. Shibuya is a trendy spot to hang out for young people, and they were out in full force protesting the war in Iraq. After Shibuya, we visited a nice shopping district not too far away, and then went to dinner at the Outback Steakhouse, which produced the first normal and acceptable hamburger that I have eaten since I left the States!\n shi-boo-yah-scene.jpg shi-boo-yah-protestors.jpg naughty-protestor.jpg shi-boo-yah-scene-two.jpg\nAfter dinner, we headed out to Rotangi, a very sketchy bar and club district. This place was pretty nuts, and is built on some strange system of bartering and negotation over the price of drinks… we finally settled down somewhere, had a few drinks, and went back to the hotel feeling exhausted.\nThis morning, we started our day by visiting the Imperial Palance, which was extremely anti-climactic. The gardens are unattractive, and the palace itself is so heavily guarded that you can’t see hardly any of it. We then visited Shinjuku, which is supposed to be like the Times Square of Tokyo. In Shinjuku, we climbed to the top of a massive twin tower building to see the entire city. The view was amazing, and it became quickly clear that Tokyo is a very polluted city — the haze rivals Atlanta! Then, we went back to Electric Town for one last look at all the crazy electronics.\n me-makin-palace-look-cheap.jpg shinjuku-buildings.jpg shinjuku-extreme-me.jpg\nI had a great time in Tokyo this weekend, and I am now on the last leg of my 5 hour train trip to Kanazawa. My impressions of Japan have most definitely been affected by my time in Tokyo. I always thought that the United States of America was the most consumer oriented country in the world — this is simply not true. If there is one thing that I have learned from Tokyo, its that the Japanese shop like its their job. Honestly, these people have an unsatiable lust for consumption that is unmatched in the rest of the world… its simply amazing. If I ever come back to Tokyo, I shall have to make sure that I have more money next time, so that I can do my part =)\nWell, our train is pulling into the station! I will write about Kanazawa ASAP! Love you and miss you all!"
      }
    ],
    "url": [
      "/2003/the-great-city-of-tokyo"
    ],
    "published": [
      "2003-03-23T21:35:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "d86dbc3b33583a91a16665f4f587260f"
    ]
  }
}