{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Rugby, Arts Centre, and the Gardens"
    ],
    "content": [
      {
        "html": "<p>On Saturday evening, about 20 of us went to see the Wellington v. Canterbury rugby match at Jade Stadium.  From my experience at the Sevens, I expected to see a bunch of drunken hoodlums in a sort of controlled riot =)  This was exactly the opposite of what happened, strangely enough.  It seems that rugby in ChristChurch is a family affair, and thus I spent most of my time at the game surrounded by annoying children.  I had a great time anyway, but was a bit disappointed.  I definitely enjoyed the sevens <em>much</em> more than the Super 12 match I saw on Saturday night.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/arts-centre.jpg\"><img alt=\"arts-centre.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/arts-centre-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/fair-at-centre.jpg\"><img alt=\"fair-at-centre.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/fair-at-centre-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/gardens-fountain.jpg\"><img alt=\"gardens-fountain.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/gardens-fountain-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/rugby-stadium.jpg\"><img alt=\"rugby-stadium.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/rugby-stadium-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>I have been sick for the last few days, and so yesterday I spent much of my time indoors.  I managed to get out for a little while to go and visit the Arts Centre and to see a fair that was held in front of it.  This was a lot of fun, and I was able to sample some excellent cheese, look at some fine art, and enjoy some great music.</p><p>After the fair, I walked home through two parks and the Botanic Gardens.  All of the parks and the gardens were beautiful, and I snapped a few nice photos to capture the experience.</p><p>If this darn sickness ever leaves me, then I will make sure to update you all some more on what ChristChurch is like =)</p>",
        "value": "On Saturday evening, about 20 of us went to see the Wellington v. Canterbury rugby match at Jade Stadium. From my experience at the Sevens, I expected to see a bunch of drunken hoodlums in a sort of controlled riot =) This was exactly the opposite of what happened, strangely enough. It seems that rugby in ChristChurch is a family affair, and thus I spent most of my time at the game surrounded by annoying children. I had a great time anyway, but was a bit disappointed. I definitely enjoyed the sevens much more than the Super 12 match I saw on Saturday night. arts-centre.jpg fair-at-centre.jpg gardens-fountain.jpg rugby-stadium.jpg\nI have been sick for the last few days, and so yesterday I spent much of my time indoors. I managed to get out for a little while to go and visit the Arts Centre and to see a fair that was held in front of it. This was a lot of fun, and I was able to sample some excellent cheese, look at some fine art, and enjoy some great music.\nAfter the fair, I walked home through two parks and the Botanic Gardens. All of the parks and the gardens were beautiful, and I snapped a few nice photos to capture the experience.\nIf this darn sickness ever leaves me, then I will make sure to update you all some more on what ChristChurch is like =)"
      }
    ],
    "url": [
      "/2003/rugby-arts-centre-and-the-gardens"
    ],
    "published": [
      "2003-02-23T20:09:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "8163067d322a594d40721650aa59f1e8"
    ]
  }
}