{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Fair, glow worms, and Rivendell..."
    ],
    "content": [
      {
        "html": "<p>Today, four of us took a wonderful day trip packed full of amazing experiences.  We began our day with a good breakfast in the city early in the morning.  We then walked to the Wellington Visitors Center and rented a car to transport us around for the day.</p><p>Starting in Wellington, we took the highway up into the mountains, through curvy roads, steep mountain walls, and beautiful scenery.  We almost made it through without anyone getting sick, but right at the end, one of the ladies in the car just couldn't handle it anymore and got sick =(  After this short delay, we were back in the car.  We drove through Featherston and into a town fair.  At the fair were hundreds of little booths devoted to leatherwork, wool products, art, trinkets, books, and many other things.  We spent a solid 3 hours at the fair, and I enjoyed a great New Zealand style steak sandwich for lunch.  After we had all finished up, we packed back into the car for the next leg of our journey.</p><p>We then travelled down a narrow gravel road, honking as we turned corners to avoid hitting oncoming vehicles.  This road took us out into the New Zealand countryside, where it is hard not to feel like you are in Middle Earth.  At any moment, I felt as if a pack of riders from Rohan was going to burst over the edge of the mountain.  The landscape was absolutely stunning!  In the middle of the beautiful mountains is a deep cave that is home to millions of glow worms.  We rolled up our jeans, turned on our flashlights, and plunged headlong into the caves.  We had to wade in shallow water, climb over sharp rocks, and duck low to avoid the ceiling.  When we were deep inside the caves, we turned out our flashlights, and the walls of the cave came alive, with thousands of small green lights peeking out of the walls like distant stars.  Under every crack and crevice in the rock we could see even more of the little lights peeking out at us.  What an amazing experience this was!</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/middleearth.jpg\"><img alt=\"middleearth.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/middleearth-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/cavefarmfence.jpg\"><img alt=\"cavefarmfence.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/cavefarmfence-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/deepinthecaves.jpg\"><img alt=\"deepinthecaves.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/deepinthecaves-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/usinsidecave.jpg\"><img alt=\"usinsidecave.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/wellington/usinsidecave-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/meinthecave.jpg\"><img alt=\"meinthecave.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/wellington/meinthecave-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/thelongroadhome.jpg\"><img alt=\"thelongroadhome.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/wellington/thelongroadhome-thumb.jpg\" width=\"90\"/></a>\n</td>\n</tr></tbody></table><p>After leaving the caves, we hopped back into the car with our soaking wet shoes, and began our drive back through the mountains toward Wellington.  About halfway home, we turned into Kaitoke Regional Park to visit yet another <em>Lord of the Rings</em> location.  Kaitoke is the site for the legendary elf city of Rivendell.  Signs have been put up in Kaitoke guiding you to the location of the sets, where you can look up above the beautiful river into dense wooded mountains, where the city of Rivendell was digitally rendered.</p><p>After looking at Rivendell from the path, we decided to climb down from the side of the mountain and onto the river banks to get a better look.  From the base of the river, you can walk down past the Rivendell location to see <em>The Fords of Isen</em> and the spot where Eomer finds the wounded Theodred in the films.  The park was incredible, and we plan on returning sometime to camp out in the elven forests!</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/meinrivendell.jpg\"><img alt=\"meinrivendell.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/meinrivendell-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/nearrivendell.jpg\"><img alt=\"nearrivendell.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/wellington/nearrivendell-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/meatheford.jpg\"><img alt=\"meatheford.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/meatheford-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>We then returned home, exhausted from our journey, to eat dinner and watch a movie before going to bed.  What a wonderful day today has been!  I am blessed to have the opportunity to be on this trip, and I thank God for revealing himself to us all through his wonderful creation!</p><p>I love you and miss you all!</p>",
        "value": "Today, four of us took a wonderful day trip packed full of amazing experiences. We began our day with a good breakfast in the city early in the morning. We then walked to the Wellington Visitors Center and rented a car to transport us around for the day.\nStarting in Wellington, we took the highway up into the mountains, through curvy roads, steep mountain walls, and beautiful scenery. We almost made it through without anyone getting sick, but right at the end, one of the ladies in the car just couldn't handle it anymore and got sick =( After this short delay, we were back in the car. We drove through Featherston and into a town fair. At the fair were hundreds of little booths devoted to leatherwork, wool products, art, trinkets, books, and many other things. We spent a solid 3 hours at the fair, and I enjoyed a great New Zealand style steak sandwich for lunch. After we had all finished up, we packed back into the car for the next leg of our journey.\nWe then travelled down a narrow gravel road, honking as we turned corners to avoid hitting oncoming vehicles. This road took us out into the New Zealand countryside, where it is hard not to feel like you are in Middle Earth. At any moment, I felt as if a pack of riders from Rohan was going to burst over the edge of the mountain. The landscape was absolutely stunning! In the middle of the beautiful mountains is a deep cave that is home to millions of glow worms. We rolled up our jeans, turned on our flashlights, and plunged headlong into the caves. We had to wade in shallow water, climb over sharp rocks, and duck low to avoid the ceiling. When we were deep inside the caves, we turned out our flashlights, and the walls of the cave came alive, with thousands of small green lights peeking out of the walls like distant stars. Under every crack and crevice in the rock we could see even more of the little lights peeking out at us. What an amazing experience this was! middleearth.jpg cavefarmfence.jpg deepinthecaves.jpg usinsidecave.jpg meinthecave.jpg thelongroadhome.jpg\nAfter leaving the caves, we hopped back into the car with our soaking wet shoes, and began our drive back through the mountains toward Wellington. About halfway home, we turned into Kaitoke Regional Park to visit yet another Lord of the Rings location. Kaitoke is the site for the legendary elf city of Rivendell. Signs have been put up in Kaitoke guiding you to the location of the sets, where you can look up above the beautiful river into dense wooded mountains, where the city of Rivendell was digitally rendered.\nAfter looking at Rivendell from the path, we decided to climb down from the side of the mountain and onto the river banks to get a better look. From the base of the river, you can walk down past the Rivendell location to see The Fords of Isen and the spot where Eomer finds the wounded Theodred in the films. The park was incredible, and we plan on returning sometime to camp out in the elven forests! meinrivendell.jpg nearrivendell.jpg meatheford.jpg\nWe then returned home, exhausted from our journey, to eat dinner and watch a movie before going to bed. What a wonderful day today has been! I am blessed to have the opportunity to be on this trip, and I thank God for revealing himself to us all through his wonderful creation!\nI love you and miss you all!"
      }
    ],
    "url": [
      "/2003/fair-glow-worms-and-rivendell"
    ],
    "published": [
      "2003-02-01T08:54:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "8e52cc489f5c4b934bf4f7dede3e4e84"
    ]
  }
}