{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "London and 24 hours of air travel"
    ],
    "content": [
      {
        "html": "<p>I am currently on the tail end of a 13 hour flight from London to Singapore, after spending the last day and a half in London.  We arrived in London early in the morning, and spent the first part of the day resting before braving the cold weather to take a look at Tower Bridge, which was a stonesthrow away from the hotel.  After this, I managed to meet some new folks, and we took the tube over to Liechster Square, where we went pub-hopping for a few hours — nothing beats a Guinness in a real pub!</p>\n\n<p>I got to sleep around midnight GMT and woke up early the next morning for some sightseeing.  We visited big ben, parliament, Buckingham palace, and Westminster Abbey.</p>\n<table align=\"center\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/london/bigben.jpg\"><img alt=\"bigben.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/london/bigben-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/london/howmuchpoo.JPG\"><img alt=\"howmuchpoo.JPG\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/london/howmuchpoo-thumb.JPG\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/london/humps.jpg\"><img alt=\"humps.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/london/humps-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/london/lion.jpg\"><img alt=\"lion.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/london/lion-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/london/westminster.jpg\"><img alt=\"westminster.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/london/westminster-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table>\n<p>Of all the places we visited, I truly enjoyed Westminster Abbey the most because it is absolutely inspiring.  I spent a solid half-hour in a secluded room that they provide for prayer.  I thanked God for giving me the opportunity to be on the trip, what a blessing!  I also asked God to give me strength, because I am already missing Lacey like crazy... but I will survive.</p>\n\n<p>We are now making our final descent into Singapore before hopping on another plane to Brisbane, Australia for 7 and a half hours after a short layover.  I will update on Brisbane as soon as I can!</p>",
        "value": "I am currently on the tail end of a 13 hour flight from London to Singapore, after spending the last day and a half in London. We arrived in London early in the morning, and spent the first part of the day resting before braving the cold weather to take a look at Tower Bridge, which was a stonesthrow away from the hotel. After this, I managed to meet some new folks, and we took the tube over to Liechster Square, where we went pub-hopping for a few hours — nothing beats a Guinness in a real pub!\nI got to sleep around midnight GMT and woke up early the next morning for some sightseeing. We visited big ben, parliament, Buckingham palace, and Westminster Abbey. bigben.jpg howmuchpoo.JPG humps.jpg lion.jpg westminster.jpg\nOf all the places we visited, I truly enjoyed Westminster Abbey the most because it is absolutely inspiring. I spent a solid half-hour in a secluded room that they provide for prayer. I thanked God for giving me the opportunity to be on the trip, what a blessing! I also asked God to give me strength, because I am already missing Lacey like crazy... but I will survive.\nWe are now making our final descent into Singapore before hopping on another plane to Brisbane, Australia for 7 and a half hours after a short layover. I will update on Brisbane as soon as I can!"
      }
    ],
    "url": [
      "/2003/london-and-24-hours-of-air-travel"
    ],
    "published": [
      "2003-01-05T05:16:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "84217082e98427ec4aeb119be165f42f"
    ]
  }
}