{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Queenstown & Milford Sound"
    ],
    "content": [
      {
        "html": "<p>This past weekend was my last in New Zealand, so a large group of us decided to go all out on a four day road trip.  We packed 15 people into three small cars and headed out of ChristChurch late Thursday afternoon.  We stopped a few hours down the road at Lake Tekapo for dinner, and one of our cars (mine) had a dead battery, because someone (me) was stupid and left the lights on.  After a few tries and a call to the roadside assistance, we managed to jump our car and get moving.</p><p>After several more hours of travel, our car then began to realize that we were running a bit low on gas (we had about a half a tank at this point, but you can never be too careful in a place like New Zealand).  We drove and drove, but the further south that we traveled, the fewer signs of civilization we saw.  Finally, we pulled into Cromwell, which is about 45 kilometers from our destination.  We rolled into the gas station with about 1 litre of gas remaining in our tank as they were turning off the pumps, and they were kind enough to allow us to fuel up.  Relieved, we arrived at our hotel in Queenstown around 1:30 AM, ready to sleep.</p><p>In the morning, we awoke refreshed and ready for a big day.  Queenstown is the adventure capital of New Zealand, with plenty of opportunities to skydive, bungee jump, jet boat, etc.  In the morning, we elected to ride the \"gondola\" (a glorified ski lift) up to the top of one of the mountains to ride on the mountain luge.  The mountain luge is essentially a concrete track that winds its way steeply down the mountain.  Once you purchase a ticket, and strap a helment on your head, you can ride a small sled-like cart down the track at extremely ludicrous speeds.  This was an absolute blast, and we all had a great time racing each other, getting into wrecks, and generally causing trouble.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/queenstown-from-lift.jpg\"><img alt=\"queenstown-from-lift.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/queenstown-from-lift-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/luge-from-lift.jpg\"><img alt=\"luge-from-lift.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/luge-from-lift-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/ready-to-luge.jpg\"><img alt=\"ready-to-luge.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/ready-to-luge-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>After our fun on the luge, we headed back down the mountain on the gondola, ate lunch, and walked around the town, which is absolutely beautiful.  Queenstown is nestled in the middle of a bunch of beautiful mountain ranges, including one of the most stunning mountain ranges in New Zealand, <em>the remarkables</em>.  The mountains are broken up by small valleys and lakes, which Queenstown sits in the center of.  Pictures and words really cannot do this place justice — it is easily the most beautiful place I have seen in New Zealand.</p><p>At 3:00 PM, three of us were picked up at the information center by the Thermal Velocity bus to travel a few kilometers out of town to go hang gliding.  As we drove up to the landing site, the drivers talked with us about the experience and generally got us all excited about what we were preparing to do.  Upon arrival at the landing site, we met with our pilots, and watched them disassemble the gliders to pack them up for our trip to the launching site.  We then rode in a bus up the mountain to a small parking lot, and were given a brief lesson on how to take off, land, steer, and be safe.  The view from the peak was absolutely stunning, and I was truly excited, but a little nervous, before takeoff.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/queenstown-pano-small.jpg\"><img alt=\"queenstown-pano-small.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/queenstown-pano-small-thumb.jpg\" width=\"315\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/me-before-hanggliding.jpg\"><img alt=\"me-before-hanggliding.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/me-before-hanggliding-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/preparing-gliders.jpg\"><img alt=\"preparing-gliders.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/preparing-gliders-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>My pilot, a swedish guy named Anders, and I were coupled together by a few carabeaners, and we took our position underneath the glider.  We picked it up, aimed it at the edge of the cliff, and waited for some wind.  On Anders' command, we began to run together at full speed toward the edge, and continued running for a few seconds down the steep cliff until the wind picked us up.  I pushed my feet against the bottom of my harness, as instructed, and we were airborne.  The feeling of unhindered and controlled flight was amazing, and not at all frightening.  The glider can be controlled effortlessly by leaning, pushing, and pulling.  We glided parallel to the mountains for a while, enjoying the view, and looking for thermal pockets to ride to higher altitude.  Suddenly, we found a pocket of rising, hot air, and shot upwards.  Now high above the ground, we headed slowly away from the mountains.  Anders allowed me to pilot the glider for a few minutes, which was sort of scary, but very cool.</p><p>As we approached the landing site, I noticed that we were near the field in distance, but far too high above to land on it with our heading and speed.  I asked Anders about this, and he smiled.  He told me to push forward on the control bar as hard as I could, so I forced my arms forward, and our nose began to point directly upward.  Anders took control, and we stalled, plummeting toward the earth, and then gracefully shot back upwards.  We did a few more extremely exciting tricks, losing a lot of altitude, and then did a nose dive towards the ground, finally leveling off at the last second for a fairly smooth landing.  What an amazing experience!  We were only in the air for 15 or 20 minutes, but it was peaceful, beautiful, and exciting!  <em>Everyone</em> should do this at least once.  I have a roll of undeveloped film from a camera that was attached to the glider, and I will try and post some pictures as soon as possible.</p><p>After hang gliding, we met up with the rest of the group to talk about all of our adventures for the day, and then drove until late in the evening to Milford Sound.  We stayed in a hostel that evening, and it was very sub-par, but was the only place to stay in the extremely small town.  There were no good working phones, no electricity after 11:00 PM, and a single cafe to eat at.  In addition, gas is only pumped a few times a day, so you have to be very careful and timely about your arrival and departure times.</p><p>In the morning, we drove to the harbor, and boarded a boat to take a 3 hour cruise.  Milford Sound is actually not a <em>sound</em>, but a <em>fiord</em> that was carved out by glaciers in the last ice age.  The result is a beautiful, very steeply walled mountain range enclosing a narrow channel of water.  On our cruise, we saw dolphins, seals, an underwater observatory, and enjoyed the wonderful sights.  Once we returned to the harbor, we set off for our next destination, Te Anui.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/christchurch/milford-cruise.jpg\"><img alt=\"milford-cruise.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/milford-cruise-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/milford-fiord.jpg\"><img alt=\"milford-fiord.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/milford-fiord-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/christchurch/me-milford-sound.jpg\"><img alt=\"me-milford-sound.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/christchurch/me-milford-sound-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Te Anui is a small town a few hours north of Milford Sound, and we checked into our hostel around 6:00 PM.  We then headed into the city and ate dinner at a fantastic italian restaurant.  I split an excellent pizza and a great pasta dish with a friend, and then we went out for a brief night on the town.  Upon return to the hostel, we crashed into our beds, exhausted.  This morning, we woke up around 9:00 AM, and drove 7 hours back to ChristChurch.  It was an amazing weekend, and a great way to wrap up my time here in New Zealand!  I still have a week left here in ChristChurch, and then I am off to Cairns, Australia and finally, to Japan!</p><p>I love you and miss you all!</p>",
        "value": "This past weekend was my last in New Zealand, so a large group of us decided to go all out on a four day road trip. We packed 15 people into three small cars and headed out of ChristChurch late Thursday afternoon. We stopped a few hours down the road at Lake Tekapo for dinner, and one of our cars (mine) had a dead battery, because someone (me) was stupid and left the lights on. After a few tries and a call to the roadside assistance, we managed to jump our car and get moving.\nAfter several more hours of travel, our car then began to realize that we were running a bit low on gas (we had about a half a tank at this point, but you can never be too careful in a place like New Zealand). We drove and drove, but the further south that we traveled, the fewer signs of civilization we saw. Finally, we pulled into Cromwell, which is about 45 kilometers from our destination. We rolled into the gas station with about 1 litre of gas remaining in our tank as they were turning off the pumps, and they were kind enough to allow us to fuel up. Relieved, we arrived at our hotel in Queenstown around 1:30 AM, ready to sleep.\nIn the morning, we awoke refreshed and ready for a big day. Queenstown is the adventure capital of New Zealand, with plenty of opportunities to skydive, bungee jump, jet boat, etc. In the morning, we elected to ride the \"gondola\" (a glorified ski lift) up to the top of one of the mountains to ride on the mountain luge. The mountain luge is essentially a concrete track that winds its way steeply down the mountain. Once you purchase a ticket, and strap a helment on your head, you can ride a small sled-like cart down the track at extremely ludicrous speeds. This was an absolute blast, and we all had a great time racing each other, getting into wrecks, and generally causing trouble. queenstown-from-lift.jpg luge-from-lift.jpg ready-to-luge.jpg\nAfter our fun on the luge, we headed back down the mountain on the gondola, ate lunch, and walked around the town, which is absolutely beautiful. Queenstown is nestled in the middle of a bunch of beautiful mountain ranges, including one of the most stunning mountain ranges in New Zealand, the remarkables. The mountains are broken up by small valleys and lakes, which Queenstown sits in the center of. Pictures and words really cannot do this place justice — it is easily the most beautiful place I have seen in New Zealand.\nAt 3:00 PM, three of us were picked up at the information center by the Thermal Velocity bus to travel a few kilometers out of town to go hang gliding. As we drove up to the landing site, the drivers talked with us about the experience and generally got us all excited about what we were preparing to do. Upon arrival at the landing site, we met with our pilots, and watched them disassemble the gliders to pack them up for our trip to the launching site. We then rode in a bus up the mountain to a small parking lot, and were given a brief lesson on how to take off, land, steer, and be safe. The view from the peak was absolutely stunning, and I was truly excited, but a little nervous, before takeoff. queenstown-pano-small.jpg me-before-hanggliding.jpg preparing-gliders.jpg\nMy pilot, a swedish guy named Anders, and I were coupled together by a few carabeaners, and we took our position underneath the glider. We picked it up, aimed it at the edge of the cliff, and waited for some wind. On Anders' command, we began to run together at full speed toward the edge, and continued running for a few seconds down the steep cliff until the wind picked us up. I pushed my feet against the bottom of my harness, as instructed, and we were airborne. The feeling of unhindered and controlled flight was amazing, and not at all frightening. The glider can be controlled effortlessly by leaning, pushing, and pulling. We glided parallel to the mountains for a while, enjoying the view, and looking for thermal pockets to ride to higher altitude. Suddenly, we found a pocket of rising, hot air, and shot upwards. Now high above the ground, we headed slowly away from the mountains. Anders allowed me to pilot the glider for a few minutes, which was sort of scary, but very cool.\nAs we approached the landing site, I noticed that we were near the field in distance, but far too high above to land on it with our heading and speed. I asked Anders about this, and he smiled. He told me to push forward on the control bar as hard as I could, so I forced my arms forward, and our nose began to point directly upward. Anders took control, and we stalled, plummeting toward the earth, and then gracefully shot back upwards. We did a few more extremely exciting tricks, losing a lot of altitude, and then did a nose dive towards the ground, finally leveling off at the last second for a fairly smooth landing. What an amazing experience! We were only in the air for 15 or 20 minutes, but it was peaceful, beautiful, and exciting! Everyone should do this at least once. I have a roll of undeveloped film from a camera that was attached to the glider, and I will try and post some pictures as soon as possible.\nAfter hang gliding, we met up with the rest of the group to talk about all of our adventures for the day, and then drove until late in the evening to Milford Sound. We stayed in a hostel that evening, and it was very sub-par, but was the only place to stay in the extremely small town. There were no good working phones, no electricity after 11:00 PM, and a single cafe to eat at. In addition, gas is only pumped a few times a day, so you have to be very careful and timely about your arrival and departure times.\nIn the morning, we drove to the harbor, and boarded a boat to take a 3 hour cruise. Milford Sound is actually not a sound, but a fiord that was carved out by glaciers in the last ice age. The result is a beautiful, very steeply walled mountain range enclosing a narrow channel of water. On our cruise, we saw dolphins, seals, an underwater observatory, and enjoyed the wonderful sights. Once we returned to the harbor, we set off for our next destination, Te Anui. milford-cruise.jpg milford-fiord.jpg me-milford-sound.jpg\nTe Anui is a small town a few hours north of Milford Sound, and we checked into our hostel around 6:00 PM. We then headed into the city and ate dinner at a fantastic italian restaurant. I split an excellent pizza and a great pasta dish with a friend, and then we went out for a brief night on the town. Upon return to the hostel, we crashed into our beds, exhausted. This morning, we woke up around 9:00 AM, and drove 7 hours back to ChristChurch. It was an amazing weekend, and a great way to wrap up my time here in New Zealand! I still have a week left here in ChristChurch, and then I am off to Cairns, Australia and finally, to Japan!\nI love you and miss you all!"
      }
    ],
    "url": [
      "/2003/queenstown-milford-sound"
    ],
    "published": [
      "2003-03-02T23:13:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "9f53aaaee84d6dd20b70a280ddd0c361"
    ]
  }
}