{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Moreton Island"
    ],
    "content": [
      {
        "html": "<p>Yesterday a group of us took a day trip to Moreton Island, which is home to the world's largest sand dunes.  We started the day at 6:00 AM with a bus ride, and arrived in Moreton Bay around 7:30 AM.  We boarded a small racing sail-boat called <em>SOLO</em>, which has apparantly been around the world several times, and has won some fairly significant races.  The boat departed for our 3 hour sail over to the island.  We all enjoyed the boat ride out, which was smooth, sunny, and beautiful.</p><p>When we pulled into the island, we were allowed to jump off of the boat and take a swim over to the island.  Once on the island, we were treated to a variety of water sports, including tubing and snorkeling around sunken ships.  We were supposed to be allowed to sand board down 200 foot sand dunes, but the people running the trip claimed that the sand was too hot... but I don't buy it.  So, I went ahead and climbed the dunes on my own several times, and ran down them, jumped off them, and generally put myself into danger — lots of fun =)</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/brisbane/viewfromdune.jpg\"><img alt=\"viewfromdune.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/viewfromdune-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/brisbane/meatopthedunes.jpg\"><img alt=\"meatopthedunes.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/brisbane/meatopthedunes-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>The island was stunningly beautiful, and had the bluest and clearest water that I have ever seen.  Overall, it was a great trip — until the ride back.  The wind picked up about and hour before we left the island, and by the time we had eaten lunch and were preparing to head home, the wind was blasting us, and the ocean had sprung to life with some very large swells (6-8 feet).  This made for a horrific 4 hour journey back home, complete with water splashing into the cabin, people puking over the side of the boat, and crying asian tourists.  Luckily, one of the people on our trip brought prescription strength dramamine with them, and I took two of them.  I basically just passed out in the cabin from drowsiness, and awoke with a pretty bad motion sickness hangover.</p><p>Overall the trip was fun, and I really enjoyed myself!  I will make sure to blog later about a summary of my experience in Brisbane, and my journey to Sydney.</p>",
        "value": "Yesterday a group of us took a day trip to Moreton Island, which is home to the world's largest sand dunes. We started the day at 6:00 AM with a bus ride, and arrived in Moreton Bay around 7:30 AM. We boarded a small racing sail-boat called SOLO, which has apparantly been around the world several times, and has won some fairly significant races. The boat departed for our 3 hour sail over to the island. We all enjoyed the boat ride out, which was smooth, sunny, and beautiful.\nWhen we pulled into the island, we were allowed to jump off of the boat and take a swim over to the island. Once on the island, we were treated to a variety of water sports, including tubing and snorkeling around sunken ships. We were supposed to be allowed to sand board down 200 foot sand dunes, but the people running the trip claimed that the sand was too hot... but I don't buy it. So, I went ahead and climbed the dunes on my own several times, and ran down them, jumped off them, and generally put myself into danger — lots of fun =) viewfromdune.jpg meatopthedunes.jpg\nThe island was stunningly beautiful, and had the bluest and clearest water that I have ever seen. Overall, it was a great trip — until the ride back. The wind picked up about and hour before we left the island, and by the time we had eaten lunch and were preparing to head home, the wind was blasting us, and the ocean had sprung to life with some very large swells (6-8 feet). This made for a horrific 4 hour journey back home, complete with water splashing into the cabin, people puking over the side of the boat, and crying asian tourists. Luckily, one of the people on our trip brought prescription strength dramamine with them, and I took two of them. I basically just passed out in the cabin from drowsiness, and awoke with a pretty bad motion sickness hangover.\nOverall the trip was fun, and I really enjoyed myself! I will make sure to blog later about a summary of my experience in Brisbane, and my journey to Sydney."
      }
    ],
    "url": [
      "/2003/moreton-island"
    ],
    "published": [
      "2003-01-11T20:16:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "446e6e1ee8d273904bcfa315bbf329d0"
    ]
  }
}