{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Last weekend in Wellington!"
    ],
    "content": [
      {
        "html": "<p>This weekend was my last in Wellington, and I am currently packing and preparing for my trip to ChristChurch on the South Island tomorrow morning at 8:30 AM.  I wanted to make sure that this weekend was a good one, so we planned a huge road trip in a 10-passenger van, leaving on Thursday evening.</p><p>Our first stop was a campground in Matamata, a small farming community in the northern part of the island.  Why did we stop here, you ask?  Well, in 1999, a helicopter was flying over New Zealand and looked down to see a farm in Matamata.  This farm had a few unique features, such as a lake, a very attractive and symmetrical tree, and a rolling landscape surrounding it.  A few days later, an executive from New Line Pictures showed up at the farmer's door and asked the farmer if he could use his land in a movie trilogy called <em>The Lord of the Rings</em>.  The rest is history — Matamata is now known around New Zealand as <i>Hobbiton</i>.\n\n</p><p>In the morning, our group took a tour of the Hobbiton movie set, which allowed us to see the remains of the hobbit holes from the films, walk around the lake, visit the \"party field\" and the famous \"party tree\", and take a lot of pictures.  We were able to get a few group shots of us at <em>Bag End</em> (Bilbo's home), and one of me under the party tree where Bilbo gave his speech.  Most of the set has been destroyed, as it was made of polystyrene and plywood, but many of the hobbit holes remain, including the most important few.  The family that runs the tour is not even allowed to maintain the remaining holes, so I was lucky to be able to see it while its still possible!</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/usashobbits.jpg\"><img alt=\"usashobbits.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/usashobbits-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/meoverhobbiton.jpg\"><img alt=\"meoverhobbiton.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/meoverhobbiton-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/meinfrontofhobbitholes.jpg\"><img alt=\"meinfrontofhobbitholes.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/meinfrontofhobbitholes-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/hobbitonfrombagend.jpg\"><img alt=\"hobbitonfrombagend.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/hobbitonfrombagend-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/groupatbagend.jpg\"><img alt=\"groupatbagend.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/groupatbagend-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Following our tour in Hobbiton, we hopped back into our van and began the long drive southeast to the coastal wine country.  The city in the center of the wine country is called Napier, and is on the east coast of New Zealand.  Many years ago, Napier was hit by a massive earthquake and was completely destroyed.  Following the quake, the city's people decided to rebuild the city in the grand Art-Deco style.  This weekend was the city's annual Art Deco Weekend, and we were there to witness it.  The city is quite beautiful, and I unfortunately was unable to take many pictures while I was there, but there are many pictures available of the city itself on the internet.  It was packed with old-time cars, and people dressed in the extravagant style of the early 20th century.  They all pack into the city, dance to jazz music on the beach, and enjoy the Art Deco scenery.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/bombersatfestival.jpg\"><img alt=\"bombersatfestival.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/bombersatfestival-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/artdeconapier.jpg\"><img alt=\"artdeconapier.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/wellington/artdeconapier-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/wellington/oldcar.jpg\"><img alt=\"oldcar.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/oldcar-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/wellington/napierbeach.jpg\"><img alt=\"napierbeach.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/wellington/napierbeach-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>We ate a beautiful dinner in Napier, enjoyed the sights, and were back in the van by 9:00 PM to travel to our final campsite at Kaitoke Regional Park, which I had visited a few weeks ago.  About 10 minutes after we left Napier, rain started to pound the car, and I had to drive the old, creaky, manual transmission van through the windy and narrow mountain roads in the rainy dark... this was not so much fun, but now I am a pro driving on the left hand side of the road and shifting with my left hand =).  When we arrived at the park, they had locked the gate, so we parked in the car park.  The van can hold 10 people sitting up, but only 4 can really sleep in it, so me and two other brave souls grabbed a tent, and hiked in the rain until we found a suitable campsite.  Surprisingly enough, we slept through the night without the tent springing a leak, and woke up dry and refreshed!</p><p>Another great weekend!  I am truly going to miss Wellington.  The people here are nice, the city is full of things to do, and it is in one of the most beautiful locations I have ever visited.  The only thing I am not going to miss about Wellington is the food =)</p><p>Talk to you soon from ChristChurch!</p>",
        "value": "This weekend was my last in Wellington, and I am currently packing and preparing for my trip to ChristChurch on the South Island tomorrow morning at 8:30 AM. I wanted to make sure that this weekend was a good one, so we planned a huge road trip in a 10-passenger van, leaving on Thursday evening.\nOur first stop was a campground in Matamata, a small farming community in the northern part of the island. Why did we stop here, you ask? Well, in 1999, a helicopter was flying over New Zealand and looked down to see a farm in Matamata. This farm had a few unique features, such as a lake, a very attractive and symmetrical tree, and a rolling landscape surrounding it. A few days later, an executive from New Line Pictures showed up at the farmer's door and asked the farmer if he could use his land in a movie trilogy called The Lord of the Rings. The rest is history — Matamata is now known around New Zealand as Hobbiton. \nIn the morning, our group took a tour of the Hobbiton movie set, which allowed us to see the remains of the hobbit holes from the films, walk around the lake, visit the \"party field\" and the famous \"party tree\", and take a lot of pictures. We were able to get a few group shots of us at Bag End (Bilbo's home), and one of me under the party tree where Bilbo gave his speech. Most of the set has been destroyed, as it was made of polystyrene and plywood, but many of the hobbit holes remain, including the most important few. The family that runs the tour is not even allowed to maintain the remaining holes, so I was lucky to be able to see it while its still possible! usashobbits.jpg meoverhobbiton.jpg meinfrontofhobbitholes.jpg hobbitonfrombagend.jpg groupatbagend.jpg\nFollowing our tour in Hobbiton, we hopped back into our van and began the long drive southeast to the coastal wine country. The city in the center of the wine country is called Napier, and is on the east coast of New Zealand. Many years ago, Napier was hit by a massive earthquake and was completely destroyed. Following the quake, the city's people decided to rebuild the city in the grand Art-Deco style. This weekend was the city's annual Art Deco Weekend, and we were there to witness it. The city is quite beautiful, and I unfortunately was unable to take many pictures while I was there, but there are many pictures available of the city itself on the internet. It was packed with old-time cars, and people dressed in the extravagant style of the early 20th century. They all pack into the city, dance to jazz music on the beach, and enjoy the Art Deco scenery. bombersatfestival.jpg artdeconapier.jpg oldcar.jpg napierbeach.jpg\nWe ate a beautiful dinner in Napier, enjoyed the sights, and were back in the van by 9:00 PM to travel to our final campsite at Kaitoke Regional Park, which I had visited a few weeks ago. About 10 minutes after we left Napier, rain started to pound the car, and I had to drive the old, creaky, manual transmission van through the windy and narrow mountain roads in the rainy dark... this was not so much fun, but now I am a pro driving on the left hand side of the road and shifting with my left hand =). When we arrived at the park, they had locked the gate, so we parked in the car park. The van can hold 10 people sitting up, but only 4 can really sleep in it, so me and two other brave souls grabbed a tent, and hiked in the rain until we found a suitable campsite. Surprisingly enough, we slept through the night without the tent springing a leak, and woke up dry and refreshed!\nAnother great weekend! I am truly going to miss Wellington. The people here are nice, the city is full of things to do, and it is in one of the most beautiful locations I have ever visited. The only thing I am not going to miss about Wellington is the food =)\nTalk to you soon from ChristChurch!"
      }
    ],
    "url": [
      "/2003/last-weekend-in-wellington"
    ],
    "published": [
      "2003-02-14T21:37:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "ceea05d6df7c0c6cd1306017fa08806b"
    ]
  }
}