{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "The Mornington Peninsula"
    ],
    "content": [
      {
        "html": "<p>Yesterday, my biology class took a field trip to Cape Schank on the Mornington Peninsula.  In 1967, Australia's Prime Minister Harold Holt went for a swim in the Mornington Peninsula, <a href=\"http://www.theage.com.au/news/national/2001/12/31/FFX9EZEPTVC.html\">never to return</a>.  There are many theories about Holt's death, my favorite being that he was abducted by an American submarine.  Most people just think he drowned =)</p>\n<p></p><center><a href=\"http://www.skinnee.net/images/melbourne/capeschank.jpg\"><img alt=\"capeschank.jpg\" border=\"0\" height=\"94\" src=\"http://www.skinnee.net/images/melbourne/capeschank-thumb.jpg\" width=\"450\"/></a></center><p></p>\n<p>We arrived at a scenic lookout after a short bus ride and then climbed down a long boardwalk toward the tidal pools and rock formations below.  Once we arrived at the base of the mountain, we were greeted with a gorgeous view of the ocean as it splashed up onto the rocks.  There were many little creatures lurking in the tidal pools, like sea urchins, aneomones, crabs, and barnacles.  A very beautiful scene for sure!</p><p>A few of us got inspired and decided, against the probably sound advice of the instructors, to climb the steep rocks as far up as we could.  Yes, I know that this is a bad idea, but I am still alive, and I have some great pictures as a result!  The view from the top was amazing.  Absolutely incredible.  I spent a solid 30 minutes on top of the rock, looking out over the ocean, the tidal pools, and the rolling hillside.</p><p>We then hiked back up the boardwalk, and enjoyed some <em>Golden Gaytime</em> ice cream bars (I am not making this up, see the picture).</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/melbourne/ontheboardwalk.jpg\"><img alt=\"ontheboardwalk.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/melbourne/ontheboardwalk-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/melbourne/walkontheocean.jpg\"><img alt=\"walkontheocean.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/melbourne/walkontheocean-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/melbourne/katejongoldengaytime.jpg\"><img alt=\"katejongoldengaytime.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/melbourne/katejongoldengaytime-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/melbourne/climbingtherock.jpg\"><img alt=\"climbingtherock.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/melbourne/climbingtherock-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/melbourne/viewfromtherock.jpg\"><img alt=\"viewfromtherock.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/melbourne/viewfromtherock-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Following our trip to the cape, we visited yet another beach.  This beach, however, was different in several ways from the prior beaches that we have visited.  First of all, the water was completely calm and was transparent to amazing depths.  It also had deep, freezing water for the first 250 meters or so, and then rose up to a shallow, warm sandbar.  A group of us went out onto the sandbar and tossed around a frisbee.  We also saw many jellyfish, a sea cucumber or two, a very large fish that we have yet to identify, and best of all a sea horse.  The sea horse was especially cool because it was strangely friendly to us.  It swam right up to us, curled its tail tightly around our fingers and let us hold it while it swam around.</p><p>We are wrapping up our stay in Melbourne soon and preparing to travel to Wellington, New Zealand.  Tonight I am renting a car with a small group and we are driving out to the southern coast to see the penguins emerge from the water and waddle around.  A group went to see them yesterday and raved about it, so this should be exciting.  I will try and post an update later tonight or tomorrow if possible.</p><p>G'day!</p>",
        "value": "Yesterday, my biology class took a field trip to Cape Schank on the Mornington Peninsula. In 1967, Australia's Prime Minister Harold Holt went for a swim in the Mornington Peninsula, never to return. There are many theories about Holt's death, my favorite being that he was abducted by an American submarine. Most people just think he drowned =)\ncapeschank.jpg\n\nWe arrived at a scenic lookout after a short bus ride and then climbed down a long boardwalk toward the tidal pools and rock formations below. Once we arrived at the base of the mountain, we were greeted with a gorgeous view of the ocean as it splashed up onto the rocks. There were many little creatures lurking in the tidal pools, like sea urchins, aneomones, crabs, and barnacles. A very beautiful scene for sure!\nA few of us got inspired and decided, against the probably sound advice of the instructors, to climb the steep rocks as far up as we could. Yes, I know that this is a bad idea, but I am still alive, and I have some great pictures as a result! The view from the top was amazing. Absolutely incredible. I spent a solid 30 minutes on top of the rock, looking out over the ocean, the tidal pools, and the rolling hillside.\nWe then hiked back up the boardwalk, and enjoyed some Golden Gaytime ice cream bars (I am not making this up, see the picture). ontheboardwalk.jpg walkontheocean.jpg katejongoldengaytime.jpg climbingtherock.jpg viewfromtherock.jpg\nFollowing our trip to the cape, we visited yet another beach. This beach, however, was different in several ways from the prior beaches that we have visited. First of all, the water was completely calm and was transparent to amazing depths. It also had deep, freezing water for the first 250 meters or so, and then rose up to a shallow, warm sandbar. A group of us went out onto the sandbar and tossed around a frisbee. We also saw many jellyfish, a sea cucumber or two, a very large fish that we have yet to identify, and best of all a sea horse. The sea horse was especially cool because it was strangely friendly to us. It swam right up to us, curled its tail tightly around our fingers and let us hold it while it swam around.\nWe are wrapping up our stay in Melbourne soon and preparing to travel to Wellington, New Zealand. Tonight I am renting a car with a small group and we are driving out to the southern coast to see the penguins emerge from the water and waddle around. A group went to see them yesterday and raved about it, so this should be exciting. I will try and post an update later tonight or tomorrow if possible.\nG'day!"
      }
    ],
    "url": [
      "/2003/the-mornington-peninsula"
    ],
    "published": [
      "2003-01-23T20:43:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "7910751d4c79b2cea62e45abce4ac2a7"
    ]
  }
}