{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Miyajima and the Peace Park"
    ],
    "content": [
      {
        "html": "<p>Yesterday, a group of us hopped on a train after class and then took a ferry out to a small island near Hiroshima called <em>Miyajima</em>.  The ferry ride out to the island was beautiful, and we were able to see beautiful parks, a seven story pagoda, and watch the locals collecting clams off the beach at low tide.  The island was stunningly beautiful, and there were deer running around everywhere that we were free to pet and feed.  There were little shops selling every range of goods, from freshly brewed sake, to giant statues of Buddha, to cheesy tourist items.  The island was an excellent day trip, and I thoroughly enjoyed my visit!</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/hiroshima/clam-collectors.jpg\"><img alt=\"clam-collectors.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/hiroshima/clam-collectors-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/me-miyajima.jpg\"><img alt=\"me-miyajima.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/me-miyajima-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/miyajima-pagoda.jpg\"><img alt=\"miyajima-pagoda.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/miyajima-pagoda-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/me-funny-hat.jpg\"><img alt=\"me-funny-hat.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/hiroshima/me-funny-hat-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/hiroshima/strong-jon.jpg\"><img alt=\"strong-jon.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/strong-jon-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/group-miyajima.jpg\"><img alt=\"group-miyajima.jpg\" border=\"0\" height=\"104\" src=\"http://www.skinnee.net/images/hiroshima/group-miyajima-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/miyajima-bridge.jpg\"><img alt=\"miyajima-bridge.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/miyajima-bridge-thumb.jpg\" width=\"90\"/></a>\n</td>\n</tr></tbody></table><p>Today, on the same day that the United States began its attack on Iraq, I visited the Hiroshima Peace Park and Museum, which commemorates the dropping of the first atomic bomb on Hiroshima during the second World War.  The park is quite beautiful, and has several significant sites of interest.  First, is the children's memorial, which stands as a monument to the children who died as a result of the bomb, including those who died from aftereffects of radiation.  The memorial is filled with many origami cranes, because there was a child who believed that she would be able to survive the radiation if she folded 1000 cranes — she died before she made it to 1000, but new cranes arrive every day in her memory.</p><p>The next significant monument in the park is the victims mound, which sits in the middle of the park.  The mound is made out of the ashes of many of the victims of the bomb, and is a shocking memorial of the terror of that day.  Following our walk through the park, we visited the museum, which is an excellent way to get a feel for the history of the area and of the dropping of the bomb.  The museum and the city are harshly aligned against nuclear testing, and are constantly fighting for the destruction of all nuclear weaponry.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/hiroshima/hitroshima-a-dome.jpg\"><img alt=\"hitroshima-a-dome.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/hiroshima/hitroshima-a-dome-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/childrens-memorial.jpg\"><img alt=\"childrens-memorial.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/childrens-memorial-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/peace-park-view.jpg\"><img alt=\"peace-park-view.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/peace-park-view-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/victims-mound.jpg\"><img alt=\"victims-mound.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/hiroshima/victims-mound-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>My experience at the museum touched me, and struck a real chord in my heart and mind as our country heads to war.  It made me think about the impacts of the war that we have entered into, and while I don't like the fact that we have elected for the use of force without the support of the world, I do hope that the elimination of one more tyrant will make the world a safer place.  A few weeks ago, I felt confident that the war would be a mistake, and now I am not so sure how to feel.  One thing is for sure though, my prayers go out to our troops in Iraq and to the Iraqi people, and I hope and pray for a short war with few casualties.</p><p>Tomorrow morning I leave for a three day trip to Tokyo before my last week in Japan in Kanazawa.  I love you all and I miss you!</p>",
        "value": "Yesterday, a group of us hopped on a train after class and then took a ferry out to a small island near Hiroshima called Miyajima. The ferry ride out to the island was beautiful, and we were able to see beautiful parks, a seven story pagoda, and watch the locals collecting clams off the beach at low tide. The island was stunningly beautiful, and there were deer running around everywhere that we were free to pet and feed. There were little shops selling every range of goods, from freshly brewed sake, to giant statues of Buddha, to cheesy tourist items. The island was an excellent day trip, and I thoroughly enjoyed my visit! clam-collectors.jpg me-miyajima.jpg miyajima-pagoda.jpg me-funny-hat.jpg strong-jon.jpg group-miyajima.jpg miyajima-bridge.jpg\nToday, on the same day that the United States began its attack on Iraq, I visited the Hiroshima Peace Park and Museum, which commemorates the dropping of the first atomic bomb on Hiroshima during the second World War. The park is quite beautiful, and has several significant sites of interest. First, is the children's memorial, which stands as a monument to the children who died as a result of the bomb, including those who died from aftereffects of radiation. The memorial is filled with many origami cranes, because there was a child who believed that she would be able to survive the radiation if she folded 1000 cranes — she died before she made it to 1000, but new cranes arrive every day in her memory.\nThe next significant monument in the park is the victims mound, which sits in the middle of the park. The mound is made out of the ashes of many of the victims of the bomb, and is a shocking memorial of the terror of that day. Following our walk through the park, we visited the museum, which is an excellent way to get a feel for the history of the area and of the dropping of the bomb. The museum and the city are harshly aligned against nuclear testing, and are constantly fighting for the destruction of all nuclear weaponry. hitroshima-a-dome.jpg childrens-memorial.jpg peace-park-view.jpg victims-mound.jpg\nMy experience at the museum touched me, and struck a real chord in my heart and mind as our country heads to war. It made me think about the impacts of the war that we have entered into, and while I don't like the fact that we have elected for the use of force without the support of the world, I do hope that the elimination of one more tyrant will make the world a safer place. A few weeks ago, I felt confident that the war would be a mistake, and now I am not so sure how to feel. One thing is for sure though, my prayers go out to our troops in Iraq and to the Iraqi people, and I hope and pray for a short war with few casualties.\nTomorrow morning I leave for a three day trip to Tokyo before my last week in Japan in Kanazawa. I love you all and I miss you!"
      }
    ],
    "url": [
      "/2003/miyajima-and-the-peace-park"
    ],
    "published": [
      "2003-03-20T23:48:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "b6e32711211bd4137dd808b69111c6d5"
    ]
  }
}