{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Sydney's perspective"
    ],
    "content": [
      {
        "html": "<p>Today was my last full day in Sydney, and I think that I have finally developed a real sort of appreciation for the place.  Is Sydney the clean, cultured, picturesque city that Brisbane is?  No, decidedly not.  At first impression, Sydney is a dirty, busy, unsafe city with a shiny surface around the harbor.  After today, I am most certain that I was wrong about Sydney.  Sydney offers you what many cities cannot: perspective.</p><p>Today was spent first by heading to a show at the famous Sydney Opera House called <i>Black Chicks Talking</i>, which tells the story of four very different women with aboriginal heritage.  Before this show, I had no idea about the depth and beauty of the tradition of the aboriginal people.  The show was simply beautiful!  The women in the show were each torn between a love for the oldest known living tradition in the world and a desire to better themselves and know themselves deeply.  I have a real and true appreciation for these people now, and I have already determined to pick up a book on the subject at my next location.  The history of the aboriginal people is unquestionably moving, I would encourage everyone to learn about it.  Never before had I realized that the issues surrounding aboriginals were so vast and complicated.  Sydney's booming cultural icon has given me its first gift of perspective.</p><p>Today, I also visited Sydney's Royal Botanical Gardens.  It seems that every major city in Australia has a botanical gardens, and I must say, they are the best part of every city I have been in thus far.  Certainly, Circular Quay and the Harbor are Sydney's most well known sites, and are breathtaking in the traditional sense, but for some reason these gardens fascinate me.  There is something very beautiful about a garden in the center of a large city.  The buildings soar overhead, while you look over long, beautiful fields spotted with exotic and beautiful foliage.  People are sprawled all about, eating, reading, typing away on their laptops, and enjoying the sun and natural surroundings on their collective lunch breaks.  Its just beautiful.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/sydney/botanicalgardens.jpg\"><img alt=\"botanicalgardens.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/botanicalgardens-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/sydney/statuelight.jpg\"><img alt=\"statuelight.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/sydney/statuelight-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/sydney/beeflower.jpg\"><img alt=\"beeflower.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/sydney/beeflower-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><p>Sydney's botanitcal garden is not nearly as well kept as Brisbane's, but like everything in Sydney, its scale is beyond any sort of logical comprehension — its just huge, and impossible to take in.  The great thing about botanical gardens though is that you aren't trying to take in everything possible.  Its not like with other tourist sites, where you have a list of locations and exhibitions that you absolutely must see.  The botanical gardens are much more forgiving, because you can't see it all.  In fact, you can spend hours on just one flower!  I stood in front of a brightly lit sunflower for a solid half hour while bees buzzed and flew around its center in the wind.  The fact that you are there, and appreciating God's creation in the midst of man's skyscraping works is the whole point.  Like my experience in the Opera House, the gardens provided me with another gift of perspective.  Staring up at a crowd of massive man-made structures, one is most certainly impressed with the complexity of what we have accomplished.  But, then you immediately can stare at a single common flower, and be gripped by how amazing nature is.  That's perspective.</p><p>Thanks, Sydney.</p>",
        "value": "Today was my last full day in Sydney, and I think that I have finally developed a real sort of appreciation for the place. Is Sydney the clean, cultured, picturesque city that Brisbane is? No, decidedly not. At first impression, Sydney is a dirty, busy, unsafe city with a shiny surface around the harbor. After today, I am most certain that I was wrong about Sydney. Sydney offers you what many cities cannot: perspective.\nToday was spent first by heading to a show at the famous Sydney Opera House called Black Chicks Talking, which tells the story of four very different women with aboriginal heritage. Before this show, I had no idea about the depth and beauty of the tradition of the aboriginal people. The show was simply beautiful! The women in the show were each torn between a love for the oldest known living tradition in the world and a desire to better themselves and know themselves deeply. I have a real and true appreciation for these people now, and I have already determined to pick up a book on the subject at my next location. The history of the aboriginal people is unquestionably moving, I would encourage everyone to learn about it. Never before had I realized that the issues surrounding aboriginals were so vast and complicated. Sydney's booming cultural icon has given me its first gift of perspective.\nToday, I also visited Sydney's Royal Botanical Gardens. It seems that every major city in Australia has a botanical gardens, and I must say, they are the best part of every city I have been in thus far. Certainly, Circular Quay and the Harbor are Sydney's most well known sites, and are breathtaking in the traditional sense, but for some reason these gardens fascinate me. There is something very beautiful about a garden in the center of a large city. The buildings soar overhead, while you look over long, beautiful fields spotted with exotic and beautiful foliage. People are sprawled all about, eating, reading, typing away on their laptops, and enjoying the sun and natural surroundings on their collective lunch breaks. Its just beautiful. botanicalgardens.jpg statuelight.jpg beeflower.jpg\nSydney's botanitcal garden is not nearly as well kept as Brisbane's, but like everything in Sydney, its scale is beyond any sort of logical comprehension — its just huge, and impossible to take in. The great thing about botanical gardens though is that you aren't trying to take in everything possible. Its not like with other tourist sites, where you have a list of locations and exhibitions that you absolutely must see. The botanical gardens are much more forgiving, because you can't see it all. In fact, you can spend hours on just one flower! I stood in front of a brightly lit sunflower for a solid half hour while bees buzzed and flew around its center in the wind. The fact that you are there, and appreciating God's creation in the midst of man's skyscraping works is the whole point. Like my experience in the Opera House, the gardens provided me with another gift of perspective. Staring up at a crowd of massive man-made structures, one is most certainly impressed with the complexity of what we have accomplished. But, then you immediately can stare at a single common flower, and be gripped by how amazing nature is. That's perspective.\nThanks, Sydney."
      }
    ],
    "url": [
      "/2003/sydneys-perspective"
    ],
    "published": [
      "2003-01-17T07:41:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "45cfe76ea2bd7ee08f55316b44d00c44"
    ]
  }
}