{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Life in Hiroshima"
    ],
    "content": [
      {
        "html": "<p>We arrived in Hiroshima on Sunday night, and took a bus trip to our hotel — <em>The Hiroshima Prince Hotel</em>.  The hotel is absolutely stunning, with an excellent view of the bay, large rooms, and good food.  Its really a nice change from Kyoto!  Hiroshima is also a much cleaner and more modern city than Kyoto, since it was essentially completely destroyed in fairly recent history.  The streets are cleaner, the buildings more modern and attractive, and much more organized.</p><p>The only real downside for our hotel is that it is very far from the center of the city.  We can take busses into town, but they cost ¥230 each way (roughly $2.00 USD), so you have to really plan your days out.  We cannot really walk anywhere but to the laundry.  But, all in all, I really do enjoy the hotel quite a bit, and its a great change of pace.  In addition, our hotel is right across the street from a massive indoor snowboarding arena, which sounds like a lot of fun!</p><p>My first day in Hiroshima I spent doing laundry, and relaxing back at the hotel.  But, today I actually went into the city!  We first went to Hiroshima Castle,  which is a fairly modern building, but is built in the traditional Japanese style.  It wasn't nearly as cool as some of the other temples and government buildings that I have seen, but the view around it was quite nice.  From the peak where the central pagoda sits, you can look out over the river and into the city, and see the stadiums and skyline of Hiroshima.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/hiroshima/train-station.jpg\"><img alt=\"train-station.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/hiroshima/train-station-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/outside-castle.jpg\"><img alt=\"outside-castle.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/outside-castle-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/outside-castle-two.jpg\"><img alt=\"outside-castle-two.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/outside-castle-two-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/far-from-pagoda.jpg\"><img alt=\"far-from-pagoda.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/hiroshima/far-from-pagoda-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/hiroshima/outside-pagoda.jpg\"><img alt=\"outside-pagoda.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/outside-pagoda-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/hiroshima-stadiums.jpg\"><img alt=\"hiroshima-stadiums.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/hiroshima-stadiums-thumb.jpg\" width=\"90\"/></a>\n</td>\n</tr></tbody></table><p>Following our trip to the castle, we went to a really nice outdoor shopping center, and were able to see some fairly bizzare aspects of Japanese culture.  We went into a clothing store that had shirts featuring English words and phrases, but they made very little sense... I have included some funny pictures with this entry that will give you the idea.  I also went into the toy store, which had some of the strangest toys that I have ever seen, including video games about dating.  My personal favorite item in the toy store was a small furry pig doll named <em>\"Mr. Bacon\"</em>... I am not kidding, just look at the picture.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/hiroshima/engrish-shirt-one.jpg\"><img alt=\"engrish-shirt-one.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/hiroshima/engrish-shirt-one-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/engrish-shirt-two.jpg\"><img alt=\"engrish-shirt-two.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/hiroshima/engrish-shirt-two-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/hiroshima/mister-bacon.jpg\"><img alt=\"mister-bacon.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/hiroshima/mister-bacon-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table>\n<p></p><center><a href=\"http://www.skinnee.net/images/hiroshima/shopping-center.jpg\"><img alt=\"shopping-center.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/hiroshima/shopping-center-thumb.jpg\" width=\"90\"/></a></center><p></p>\n<p>I am having a great time here in Hiroshima, and I am looking forward to the rest of my week.  I am going to take a ferry to a small island called <em>Miya Jima</em> tomorrow, and then I am going to go and book some hotel rooms for my trip to Tokyo this weekend.  Later in the week I will be visiting the Peace Park (site of the atomic bomb dome), and possibly going to a baseball game.  I apologize for not uploading my blog entries more regularly, but most of the internet cafes I have found here in Japan do not allow me to plug in my laptop!</p><p>I will see you all pretty soon!</p>",
        "value": "We arrived in Hiroshima on Sunday night, and took a bus trip to our hotel — The Hiroshima Prince Hotel. The hotel is absolutely stunning, with an excellent view of the bay, large rooms, and good food. Its really a nice change from Kyoto! Hiroshima is also a much cleaner and more modern city than Kyoto, since it was essentially completely destroyed in fairly recent history. The streets are cleaner, the buildings more modern and attractive, and much more organized.\nThe only real downside for our hotel is that it is very far from the center of the city. We can take busses into town, but they cost ¥230 each way (roughly $2.00 USD), so you have to really plan your days out. We cannot really walk anywhere but to the laundry. But, all in all, I really do enjoy the hotel quite a bit, and its a great change of pace. In addition, our hotel is right across the street from a massive indoor snowboarding arena, which sounds like a lot of fun!\nMy first day in Hiroshima I spent doing laundry, and relaxing back at the hotel. But, today I actually went into the city! We first went to Hiroshima Castle, which is a fairly modern building, but is built in the traditional Japanese style. It wasn't nearly as cool as some of the other temples and government buildings that I have seen, but the view around it was quite nice. From the peak where the central pagoda sits, you can look out over the river and into the city, and see the stadiums and skyline of Hiroshima. train-station.jpg outside-castle.jpg outside-castle-two.jpg far-from-pagoda.jpg outside-pagoda.jpg hiroshima-stadiums.jpg\nFollowing our trip to the castle, we went to a really nice outdoor shopping center, and were able to see some fairly bizzare aspects of Japanese culture. We went into a clothing store that had shirts featuring English words and phrases, but they made very little sense... I have included some funny pictures with this entry that will give you the idea. I also went into the toy store, which had some of the strangest toys that I have ever seen, including video games about dating. My personal favorite item in the toy store was a small furry pig doll named \"Mr. Bacon\"... I am not kidding, just look at the picture. engrish-shirt-one.jpg engrish-shirt-two.jpg mister-bacon.jpg\nshopping-center.jpg\n\nI am having a great time here in Hiroshima, and I am looking forward to the rest of my week. I am going to take a ferry to a small island called Miya Jima tomorrow, and then I am going to go and book some hotel rooms for my trip to Tokyo this weekend. Later in the week I will be visiting the Peace Park (site of the atomic bomb dome), and possibly going to a baseball game. I apologize for not uploading my blog entries more regularly, but most of the internet cafes I have found here in Japan do not allow me to plug in my laptop!\nI will see you all pretty soon!"
      }
    ],
    "url": [
      "/2003/life-in-hiroshima"
    ],
    "published": [
      "2003-03-18T22:32:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "90d3fcb2cff4f725bd812ae18bccf112"
    ]
  }
}