{
  "type": [
    "h-entry"
  ],
  "properties": {
    "author": [
      {
        "type": [
          "h-card"
        ],
        "properties": {
          "url": [
            "/profile/cleverdevil",
            "/profile/cleverdevil"
          ],
          "photo": [
            "/file/e37c3982acf4f0a8421d085b9971cd71/thumb.jpg"
          ],
          "name": [
            "Jonathan LaCour"
          ]
        },
        "value": "Jonathan LaCour"
      }
    ],
    "name": [
      "Melbourne"
    ],
    "content": [
      {
        "html": "<p>Well, long time no blog!  Since its been a while since I updated, I will go ahead and give you a quick review of how things have gone for me since I last posted.</p><p>We arrived in Melbourne on Sunday in the evening after driving through the smoky landscape for nearly 9 hours.  All in all, the Canberra brush fires were the worst in the recorded history of Australia, destroying over 400 homes, and killing a fair share of people as well.  My jeans that I was wearing in Canberra now smell like I stood inside a chimney for a few hours.  Very frightening, but it was interesting to be a part of Australian history!</p><p>Here in Melbourne, we are staying at Newman College, which is part of the University of Melbourne.  Our rooms are nice, we have excellent internet connections, and the campus is beautiful.  The food is awful... oh well, you can't have everything.  The first thing that we did was walk out to the nearest \"news agent\" and purchase a pass for Melbourne's excellent light-rail system.  For about $12 US, I am able to transport myself anywhere in the city that I may want to go.  This just reminds me of how much I hate and do not miss Atlanta traffic.</p><p>Monday, I went to the Australian Open (tennis) and watched American James Blake lose, and ranked American Andy Roddick in a stunning comeback victory.  This was a lot of fun, but was spoiled a bit by the weather (smoky), and the fact that I was still dead tired after the bus ride the day before.</p><p>Yesterday, we went on a field trip to a beach south of Melbourne via <i>The Great Ocean Road</i> and swam in freezing cold antarctic waters... well, other people did, I just watched them freeze.  We then travelled to a temperate deciduous rainforest and had a brief hike.  All in all, we spent about 6 hours in the bus and one hour actually on the field trip... not so good, but tomorrow's is supposed to be a bit better of a trip.</p><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/melbourne/meonriver.jpg\"><img alt=\"meonriver.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/melbourne/meonriver-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/melbourne/riverviewone.jpg\"><img alt=\"riverviewone.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/melbourne/riverviewone-thumb.jpg\" width=\"120\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/melbourne/selfshotontheriver.jpg\"><img alt=\"selfshotontheriver.jpg\" border=\"0\" height=\"90\" src=\"http://www.skinnee.net/images/melbourne/selfshotontheriver-thumb.jpg\" width=\"120\"/></a>\n</td>\n</tr></tbody></table><table align=\"center\" border=\"0\"><tbody><tr><td>\n<a href=\"http://www.skinnee.net/images/melbourne/dalisculpture.jpg\"><img alt=\"dalisculpture.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/melbourne/dalisculpture-thumb.jpg\" width=\"90\"/></a>\n</td>\n<td>\n<a href=\"http://www.skinnee.net/images/melbourne/meaussieopen.jpg\"><img alt=\"meaussieopen.jpg\" border=\"0\" height=\"120\" src=\"http://www.skinnee.net/images/melbourne/meaussieopen-thumb.jpg\" width=\"86\"/></a>\n</td>\n</tr></tbody></table><p>That evening, a group of us went to see <a href=\"http://us.imdb.com/Title?0166924\">Mulholland Drive</a> in the Royal Botanical Gardens in an outdoor theater.  We stopped at a \"bottle shop\" beforehand to pick up some good wine and a few snacks, spread out blankets, and enjoyed the show.  This was an absolute <em>ton</em> of fun in spite of the fact that Mulholland Drive is probably the worst excuse for a film that I have ever seen.  Typically, I like strange, quirky, and confusing movies... but this just went too far.  We spent most of the movie laughing out loud at how horrible the movie was.  Great fun!</p><p>After class today, a few friends and I decided to take a walk out on the town and do some sightseeing and shopping.  We took a \"tram\" down to the beautiful victorian central station, and then walked along the river toward the Aquarium and Casino.  Along the way are shops, open air cafes, street artists, musicians, and other wonderful sights.  Melbourne is truly a beautiful city, and is currently battling Brisbane for my <em>favorite city in Australia</em> award.</p>",
        "value": "Well, long time no blog! Since its been a while since I updated, I will go ahead and give you a quick review of how things have gone for me since I last posted.\nWe arrived in Melbourne on Sunday in the evening after driving through the smoky landscape for nearly 9 hours. All in all, the Canberra brush fires were the worst in the recorded history of Australia, destroying over 400 homes, and killing a fair share of people as well. My jeans that I was wearing in Canberra now smell like I stood inside a chimney for a few hours. Very frightening, but it was interesting to be a part of Australian history!\nHere in Melbourne, we are staying at Newman College, which is part of the University of Melbourne. Our rooms are nice, we have excellent internet connections, and the campus is beautiful. The food is awful... oh well, you can't have everything. The first thing that we did was walk out to the nearest \"news agent\" and purchase a pass for Melbourne's excellent light-rail system. For about $12 US, I am able to transport myself anywhere in the city that I may want to go. This just reminds me of how much I hate and do not miss Atlanta traffic.\nMonday, I went to the Australian Open (tennis) and watched American James Blake lose, and ranked American Andy Roddick in a stunning comeback victory. This was a lot of fun, but was spoiled a bit by the weather (smoky), and the fact that I was still dead tired after the bus ride the day before.\nYesterday, we went on a field trip to a beach south of Melbourne via The Great Ocean Road and swam in freezing cold antarctic waters... well, other people did, I just watched them freeze. We then travelled to a temperate deciduous rainforest and had a brief hike. All in all, we spent about 6 hours in the bus and one hour actually on the field trip... not so good, but tomorrow's is supposed to be a bit better of a trip. meonriver.jpg riverviewone.jpg selfshotontheriver.jpg dalisculpture.jpg meaussieopen.jpg\nThat evening, a group of us went to see Mulholland Drive in the Royal Botanical Gardens in an outdoor theater. We stopped at a \"bottle shop\" beforehand to pick up some good wine and a few snacks, spread out blankets, and enjoyed the show. This was an absolute ton of fun in spite of the fact that Mulholland Drive is probably the worst excuse for a film that I have ever seen. Typically, I like strange, quirky, and confusing movies... but this just went too far. We spent most of the movie laughing out loud at how horrible the movie was. Great fun!\nAfter class today, a few friends and I decided to take a walk out on the town and do some sightseeing and shopping. We took a \"tram\" down to the beautiful victorian central station, and then walked along the river toward the Aquarium and Casino. Along the way are shops, open air cafes, street artists, musicians, and other wonderful sights. Melbourne is truly a beautiful city, and is currently battling Brisbane for my favorite city in Australia award."
      }
    ],
    "url": [
      "/2003/melbourne"
    ],
    "published": [
      "2003-01-22T07:27:00+0000"
    ],
    "post-kind": [
      "Entry"
    ],
    "post-id": [
      "5aa32917cbc834fc7063cea28d68de2b"
    ]
  }
}